from wit import Wit
import pandas as pd
import numpy as np
from sklearn.feature_extraction.text import CountVectorizer
from sklearn.metrics.pairwise import cosine_similarity
import re

df = pd.read_csv('testReq.csv')
client = Wit('OM44BHVFIPXE6QCNIJDAR5FD7WD672VI')  # Integration With Wit

def recommend(lastAnswer):
    df.rename(columns={'testReq': 'Q', 'Unnamed: 1': 'A'}, inplace=True)
    columns = ['A']
    dd = np.array(df[columns])

    An = []

    for row in dd:
        if pd.notna(row[0]):
            row[0] = row[0].strip()
            An.append(row[0])

    num = -1
    n = -1

    for i in An:
        n += 1
        if i == lastAnswer:
            num = n


    if num == -1:
        An.append(lastAnswer)
        num = len(An) - 1



    cm = CountVectorizer().fit_transform(An)

    cs = cosine_similarity(cm)
    if num == -1:
        An.pop()

    scores = list(enumerate(cs[num]))

    sorted_scores = sorted(scores, key=lambda x: x[1], reverse=True)
    sorted_scores = sorted_scores[2:]

    q = sorted_scores[0][0]
    column1 = ['Q']
    dd1 = np.array(df[column1])
    return dd1[q][0]

    
def handle_message(msg): #handling user input
    msg = client.message(msg)
    txt = msg.get('text')
    x = re.search('[u0621-u064A0]+\s*', txt)#If the message is not in Arabic language
    if x:
        return 'فضلًا اعد ادخال السؤال باللغة العربية'

    questions = {'لم', 'متى', 'هو', 'هي', 'ماذا', 'شلون', 'كيف', 'لماذا', 'هل', 'وكيف', 'وماذا', 'ولماذا', 'ومتى',
                 'وهل', 'ومن', 'وشلون'}
    question_counter = 0

    splt_txt = msg.get('text').split()
    for i in splt_txt:
        if (i in questions):
            question_counter += 1

    if (question_counter > 1):
        return 'ادخل سؤال واحد من فضلك'
    else:
        try: #specify input intent
            if msg.get('intents')[0].get('confidence') > 0.68:
                intent = msg.get('intents')[0].get('name')
                if intent == "greeting" or msg.get('entities').get('Salam:Salam') != None or msg.get('entities').get(
                        'Hala:Hala') != None or msg.get('entities').get('good_evening:good_evening') != None or msg.get(
                    'entities').get('good_morning:good_morning') != None:
                    return process_greeting(msg)
                if intent == "t3aruf":
                    return process_t3aruf(msg)
                if intent == "patent":
                    return process_patent(msg)
                if intent == "ip":
                    return process_ip(msg)
                if intent == "Trademarks":
                    return process_tm(msg)
                if intent == "industrialmodel":
                    return process_im(msg)
                if intent == "Copyright":
                    return process_copyright(msg)
                if intent == "integrated_circuits":
                    return process_ic(msg)
                if intent == "plant_varieties":
                    return process_pv(msg)
                else:
                    return 'آسفه لا استطيع اجابتك'
            else:
                return 'آسفه لا استطيع اجابتك'

        except IndexError:
            return 'آسفه لا استطيع اجابتك'


def conversation():
    return """يمكنك التسجيل لـ:
 1 - البراءات (التصاميم المعمارية، النماذج الصناعية، الأصناف النباتية، التطبيقات الإلكترونية، تصاميم الدارات المتكاملة) عن طريق الرابط: epatentsso.saip.gov.sa
 2- الاعمال المحمية بنظام حقوق المؤلف والحقوق المجاورة عن طريق الرابط: copyright.saip.gov.sa
 3-  العلامات التجارية عن طريق الرابط: tm.saip.gov.sa
 4- ترخيص ممارسة أنشطة الملكية الفكرية عن طريق الرابط: agent.saip.gov.sa """


def process_greeting(msg): #greeting intent responses
    if msg.get('entities').get('Salam:Salam') != None:
        if msg.get('entities').get('Salam:Salam')[0].get('name') == "Salam":
            if msg.get('entities').get('Salam:Salam')[0].get('confidence') > 0.70:
                return "وعليكم السلام"
    if msg.get('entities').get('Hala:Hala') != None:
        if msg.get('entities').get('Hala:Hala')[0].get('name') == "Hala":
            if msg.get('entities').get('Hala:Hala')[0].get('confidence') > 0.70:
                return "اهلا وسهلا"
    if msg.get('entities').get('good_evening:good_evening') != None:
        if msg.get('entities').get('good_evening:good_evening')[0].get('name') == "good_evening":
            if msg.get('entities').get('good_evening:good_evening')[0].get('confidence') > 0.70:
                return "مساء النور"
    if msg.get('entities').get('good_morning:good_morning') != None:
        if msg.get('entities').get('good_morning:good_morning')[0].get('name') == "good_morning":
            if msg.get('entities').get('good_morning:good_morning')[0].get('confidence') > 0.70:
                return "صباح النور"
    if msg.get('entities').get('thanks:thanks') != None:
        if msg.get('entities').get('thanks:thanks')[0].get('name') == "thanks":
            if msg.get('entities').get('thanks:thanks')[0].get('confidence') > 0.70:
                return "العفو"
    return "مرحبا"


def process_t3aruf(msg): #t3aruf intent responses
    if msg.get('entities').get('name:name') != None:
        if msg.get('entities').get('name:name')[0].get('name') == "name":
            return "أنا فريدة، مساعدتك الافتراضية "
    if msg.get('entities').get('country:country') != None:
        if msg.get('entities').get('country:country')[0].get('name') == "country":
            return "أنا من المملكة العربية السعودية"
    if msg.get('entities').get('age:age') != None:
        if msg.get('entities').get('age:age')[0].get('name') == "age":
            return "عمري ٢٥"
    if msg.get('entities').get('how-r-u:how-r-u') != None:
        if msg.get('entities').get('how-r-u:how-r-u')[0].get('name') == "how-r-u":
            return "بخير الحمدلله"
    return 'آسفة لم افهم سؤالك، من فضلك يرجى إعادة صياغة السؤال بطريقة أخرى'


def process_patent(msg): #patent intent responses
    if msg.get('entities').get('p0:p0') != None:
        if msg.get('entities').get('p0:p0')[0].get('name') == "p0":
            return "البراءة هي مستند تمنحه السلطات المختصة (عادة مكتب البراءات )، بناء لطلب يتم إيداعه لديها يصف الاختراع . وينتج عن هذا المستند وضع قانوني يمنع الغير من استغلال هذه البراءة من دون تصريح صاحبها. بمعنى أخر، فإن البراءة تحمي الاختراع وتمنح صاحبه حقاً استئثارياً باستغلاله لمدة محددة. أما الاختراع فيمكن تعريفه بأنه حل جديد لمشكلة تقنية ما."
    if msg.get('entities').get('p1:p1') != None:
        if msg.get('entities').get('p1:p1')[0].get('name') == "p1":
            return "إن الغرض من البراءة هو توفير شكل من أشكال الحماية للتقدم التكنولوجي المستمر. ونظرًيًا، فإن الحماية بواسطة البراءة تكافئ ليس فقط عملية ابتكار الاختراع، بل أيضًا طريقة تنفيذ هذا الاختراع التي بفضلها يمكن تحقيقه تقنيًا وتسويقه. وهذا الحافز يؤدي إلى الحث على المزيد من الإبداع ويشجع الشركات على الاستمرار في تطوير تقنيات جديدة لتسويق ابتكاراتها وفي جعلها أكثر فائدة ومرغوبة أكثر للصالح العام."
    if msg.get('entities').get('p2:p2') != None:
        if msg.get('entities').get('p2:p2')[0].get('name') == "p2":
            return "للبراءات دور حافز للأفراد بالاعتراف بإبداعهم ومكافأتهم ماليا لاختراعاتهم التي يمكن تسويقها. وتشجع تلك الحوافز على الابتكار الذي يضمن تحسن نوعية الحياة البشرية باستمرار."
    if msg.get('entities').get('p3:p3') != None:
        if msg.get('entities').get('p3:p3')[0].get('name') == "p3":
            return "لقد تم تطوير هذا النظام خلال عدة قرون. نجد براءات يرجع تاريخها إلى حوالى العام 1700. لقد تطور النظام في السنوات الماضية ونحن الآن نملك نظاماً حديثاً جداً ولا نزال نعمل على تطوير النظام العالمي وتحديثه ومواءمته مع التغيرات التكنولوجي والتطور الاقتصادي."
    if msg.get('entities').get('p4:p4') != None:
        if msg.get('entities').get('p4:p4')[0].get('name') == "p4":
            return "توفر الاتفاقات الدولية الحماية بواسطة البراءات لكل الاختراعات (المنتجات والعمليات) التي يتم تطويرها في كل المجالات التقنية. فالتركيبة الكيمائية يمكن أن تحصل على البراءة وكذلك الآلات وعمليات تطوير أو تحسين أو صنع الأشياء."
    if msg.get('entities').get('p5:p5') != None:
        if msg.get('entities').get('p5:p5')[0].get('name') == "p5":
            return "هناك عدة ميزات يبحث عنها مكتب البراءات ليعتبر الاختراع قابلاً للحصول على البراءة. في البدء، لا بد من إيداع طلب البراءة . في معظم الحالات يقوم خبير فني بفحص هذا الطلب للتأكد من أنه مستوف للمعايير الموضوعية المطلوبة لاستصدار البراءة. أول هذه المعايير هي أن يكون الاختراع جديداً، بمعنى أنه يجب ألا يكون قد تم صنعه أو تنفيذه أو استخدامه من قبل. المعيار الثاني هو ضرورة وجود نشاط ابتكاري، بمعنى أن الاختراع يجب أن يمثل تقدماً كافياً في حالة التقنية الصناعية السابقة حتى يعتبر مستحقاً للبراءة. المعيار الثالث هو أن الاختراع يجب أن يكون قابلاً للتطبيق الصناعي، أي للاستخدام بطريقة ما."
    if msg.get('entities').get('p6:p6') != None:
        if msg.get('entities').get('p6:p6')[0].get('name') == "p6":
            return "الأشياء الموجودة في الطبيعة التي تكتشف ولا تخترع. فلا يمكن منح البراءة مثلاً لشخص اكتشف كوكباً جديدًا. الآلات التي تتحدى قوانين الطبيعة مثل آلة الحركة المستمرة. النظريات العلمية والقواعد الحسابية. المخططات، والقواعد والأساليب ولا سيما الأساليب التجارية وتلك التي تتعلق بالنشاط العقلي والألعاب. طرق التشخيص والعلاج والجراحة اللازمة لمعالجة البشر والحيوانات. (المنتجات المستخدمة في التشخيص يمكن أن تحصل على البراءة ). النباتات والحيوانات، خلاف الأحياء الدقيقة، والطرق البيولوجية أساساً لإنتاج النباتات والحيوانات، خلاف الأساليب والطرق غير البيولوجية والبيولوجية الدقيقة."
    if msg.get('entities').get('p7:p7') != None:
        if msg.get('entities').get('p7:p7')[0].get('name') == "p7":
            return "الإجابة العامة هي أنه خلال مدة الحماية يحق لمالك البراءة منع الآخرين من صنع أو استخدام أو بيع أو استيارد الاختراع المحمي بموجب هذه البراءة . ولكن يحق له أن يتنازل عن حقوقه (يبيعها) للغير أو أن ينشئ عقود ترخيص تسمح للغير باستغلال اختراعه."
    if msg.get('entities').get('p7:p7_1') != None:
        if msg.get('entities').get('p7:p7_1')[0].get('name') == "p7":
            return "تقنيًا وبصورة خاصة جدًا تكمن فوائد البراءة في كونها تعطي لصاحبها الحق بمنع الآخرين من صنع أو استخدام أو بيع أو استيراد الاختراع في الإقليم الذي تغطيه. وهذا لا يعطي بالضرورة المخترع أو صاحب البراءة الحق في استخدام الاختراع إذا اتضح مثلاً أن هذا الاستخدام غير قانوني (كما هي الحال بالنسبة إلى استخدام آلة القمار مثلاً) ولكنه يعطيه الحق في منع الآخرين من تسويق الاختراع والاستفادة منه خلال فترة زمنية محددة."
    if msg.get('entities').get('p8:p8') != None:
        if msg.get('entities').get('p8:p8')[0].get('name') == "p8":
            return "مدة الحماية هي على الأقل 20 عاما منذ تاريخ ايداع طلب البراءة"
    if msg.get('entities').get('p9:p9') != None:
        if msg.get('entities').get('p9:p9')[0].get('name') == "p9":
            return "نعم، إن مدة الحماية وبموجب اتفاقية دولية هي على الأقل 20 عاماً منذ تاريخ إيداع طلب البراءة ."
    if msg.get('entities').get('p10:p10') != None:
        if msg.get('entities').get('p10:p10')[0].get('name') == "p10":
            return "يتمتع صاحب البراءة بحق منع الآخرين من تنفيذ الاختراع موضوع البراءة أو استخدامه أو بيعه أو استيراده. ويمكنه منع تسويق الاختراع وبيعه ولكن هذا الحق لا يطبق إلا في البلدان التي منحت البراءة."
    if msg.get('entities').get('p11:p11') != None:
        if msg.get('entities').get('p11:p11')[0].get('name') == "p11":
            return "لا، لا يمكن ذلك في ظل نظام البراءات العالمي الحالي حيث لا توجد براءة واحدة تغطي كل بلدان العالم أو حتى عددا كبيرًا من البلدان في العالم. فنظام البراءات لا يزال نظاماً إقليميا؛ ولحماية اختراع ما في بلد معين ينبغي الحصول على براءة في هذا البلد. لكن يوجد اتفاق دولي تديره الويبو ويسمى معاهدة التعاون بشأن البراءات وهو يتناول إجراءات الإيداع والبحث والنشر والفحص للطلبات الدولية. وهذه المعاهدة تسهل الحصول على البراءات في الدول المتعاقدة إذ تنص على إيداع طلب دولي واحد ومتابعته في المكاتب الوطنية أو الإقليمية المختلفة للدول الأعضاء المعينة التي يعود لها وحدها وفق أحكام هذه المعاهدة أن تمنح البراءات."
    if msg.get('entities').get('p12:p12') != None:
        if msg.get('entities').get('p12:p12')[0].get('name') == "p12":
            return "هذا صحيح. إذا كنت تملك براءات في عشر دول، عليك أن تدفع رسوم الحفاظ عليها في كل بلد من هذه البلدان العشرة، وٕإذا تخلفت عن الدفع في أحد هذه البلدان فسوف يسقط حقك بالحماية التي توفرها البراءة ."
    if msg.get('entities').get('13:p13') != None:
        if msg.get('entities').get('p13:p13')[0].get('name') == "p13":
            return "إن البراءة هي أكثر الطرق فعالية لحماية الاختراع ولكن وكما ذكرت سابقا يتم منح البراءات مقابل قيام المخترع بالكشف الكامل عن الاختراع للجمهور. توجد طريقة أخرى فعالة للحصول على الحماية هي الاحتفاظ بسرية التقنية المستعملة من خلال اللجوء إلى ما يعرف بالأسرار التجارية التي يمكن بفضلها الاحتفاظ بسرية المعلومات التي تخص الاختراع. ولكن المشكلة في هذا النوع من الحماية أنه حالما يتم طرح المنتج في السوق يمكن تفكيكه وفحصه وتحليله واكتشاف السر وهذا يؤدي بالطبع إلى فقدان الحماية. أما في حالة البراءة ، فلا يهم أن يعرف الآخرون كيف يصنع المنتج من البراءة ، لأنه في الحقيقة يكفي قراءة طلب البراءة وبالتالي لا يهم أن تكون المعلومات مكشوفا عنها أو لا، لأنك عندما تحصل على البراءة فسوف تتمتع بالحماية. أما الحماية بواسطة الأسرار التجارية فهي متاحة دائمًا ويمكن أن تكون نافعة جدًا في مجال الدراية العملية، أي الخبرة التقنية الضرورية لاستخدام تقنية ما بأكبر فعالية."
    if msg.get('entities').get('p15:p15') != None:
        if msg.get('entities').get('p15:p15')[0].get('name') == "p15":
            return "البراءة حق استئثاري يمنح نظير اختراع يكون منتجاً أو عملية تتيح طريقة جديدة لإنجاز عمل ما أو تقدم حلا تقنيا جديدا لمشكلة ما."
    if msg.get('entities').get('p16:p16') != None:
        if msg.get('entities').get('p16:p16')[0].get('name') == "p16":
            return "• يجب أن يكون جديدا بحيث يبين بعض الخصائص الجديدة غير المعروفة في مجموعة المعارف المتوافرة في مجاله التقني، ويطلق على مجموعة المعارف تلك اسم) حالة التقنية الصناعية السابقة) .  • يجب أن يبين الاختراع نشاطا ابتكارية لا يمكن لأي شخص له معرفة متوسطة في المجال التقني استنتاجه.  • لا بد أن تكون له فائدة عملية وأن يكون قابلا للتطبيق الصناعي.  • يجب أن يكون الموضوع أهلا للبراءة بموجب القانون. وفي العديد من البلدان، تدخل النظريات العلمية أو مناهج العلوم الرياضية أو الأصناف النباتية أو الحيوانية أو الاكتشافات المتعلقة بالمواد الطبيعية أو المناهج التجارية أو أساليب العلاج الطبي (على عكس المستلزمات الطبية) في عداد الموضوعات غير الأهل للبراءة عامة."
    if msg.get('entities').get('p17:p17') != None:
        if msg.get('entities').get('p17:p17')[0].get('name') == "p17":
            return "• يجب أن يكون جديدًا بحيـث يبـين بعـض الخصـائص الجديـدة غيـر المعروفـة فـي مجموعـة المعــارف المتـــوافرة فـــي مجالــه التقنـــي. ويطلــق علـــى مجموعــة المعـــارف تلـــك اســم (حالـــة التقنيـــة الصـــناعية السابقة )  .  • ويجـب أن يبـين الاختـراع نشـاطا ابتكاريـاً لا يمكـن لأي شـخص لـه معرفـة متوسـطة فـي المجـال التقنـي استنتاجه.  • فلا بد أن تكون له فائدة عملية وأن يكون قابلاً للتطبيق الصناعي.  • وفي الأخير، يجب أن يكون الموضوع (أهلا للبراءة ) بموجـب القـانون. "
    if msg.get('entities').get('p18:p18') != None:
        if msg.get('entities').get('p18:p18')[0].get('name') == "p18":
            return "أكثر الطرق شيوعا واكثرها فعالية لحماية الاختراع هي من خلال الحصول على براءة .والبراءة تمنح من قبل مكتب البراءات في البلد المطلوب حماية الاختراع فيه .ومقابل حصوله على الحقوق الاستثمارية يلتزم المخترع بالكشف عن المعلومات المتعلقة بالاختراع . ومن الطرق الاخرى للحماية هي المحافظة على سرية التقنية وهو مايعرف بالاسرار التجارية . وتسمح الحماية بموجب الاسرار التجارية بالمحافظةعلى الطبيعة السرية للمعلومات وعلى عدم الكشف عن هذه المعلومات لاشخاص غير مصرح لهم "
    if msg.get('entities').get('p19:p19') != None:
        if msg.get('entities').get('p19:p19')[0].get('name') == "p19":
            return " نعم، تسمح الحماية بموجب الأسرار التجارية بالمحافظة على الطبيعة السرية للمعلومات وعلى عدم الكشف عن هذهالمعلومات لأشخاص غير مصرح لهم."
    if msg.get('entities').get('p20:p20') != None:
        if msg.get('entities').get('p20:p20')[0].get('name') == "p20":
            return " تشمل المرحلة الأولى من إجراءات الحصول على براءة إيداع طلب براءة. ويتضمن الطلب اسم الاختراع وبيانا بمجاله التقني عامة. ومن الضروري أن يشمل الطلب خلفية الاختراع ووصفا له بلغة واضحة وتفاصيل كافية لأي شخص له معرفة متوسطة في المجال كي يستعمل الاختراع أو ينفذه. وتكون تلك الأوصاف عادة مرفقة بمواد مرئية مثل الر سوم أو التصاميم أو الرسوم البيانية لوصف الاختراع بشكل أفضل. ويشمل الطلب عدة ( مطالب ) أيضا، أي المعلومات التي تحدد نطاق الحماية الممنوحة بموجب البراءة."
    if msg.get('entities').get('p21:p21') != None:
        if msg.get('entities').get('p21:p21')[0].get('name') == "p21":
            return "عـادة أمـام المحـاكم التـي لهـا صـلاحية وقـف التعـدي علـى البـراءات فـي معظم الأنظمة."
    if msg.get('entities').get('p22:p22') != None:
        if msg.get('entities').get('p22:p22')[0].get('name') == "p22":
            return "لمالك البراءة الحق في تقرير من الـذي يجـوز لـه أو لا يجـوز لـه الانتفـاع بالاختراع المشمول بالبراءة خلال مدة حماية الاختراع. ويجوز لمالك البـراءة التصريح للغيـر أو التـرخيص له بالانتفاع بالاختراع وفقا لشروط متفق عليها ويجـوز لمالـك البـراءة أيضـا بيـع حقـه فـي الاختـراع لشـخص آخـر يصـبح بـذلك مالـك البـراءة الجديـد. وعنـد انقضاء مدة البـراءة، تنتهـي الحمايـة ويـؤول الاختـراع إلـى الملـك العـام. وهـذا يعنـي أن مالـك البـراءة لـم يعـد يتمتع بالحقوق الاستئثارية في الاختراع الذي يصبح في متناول الغير لاستغلاله في التجارة."
    if msg.get('entities').get('p23:p23') != None:
        if msg.get('entities').get('p23:p23')[0].get('name') == "p23":
            return "يمـنح البـراءة المكتـب الـوطني للبـراءات أو المكتـب الإقليمـي الـذي يعمـل لصـالح عـدة بلـدان مثـل المكتـب الأوروبي للبراءات والمنظمة الإقليمية الأفريقيـة للملكيـة الصـناعية أو مكتـب البـراءات لـدول مجلـس التعـاون الخليجـي. وبنـاء علـى تلـك الأنظمـة الإقليميـة، يلـتمس مـودع الطلـب حمايـة الاختـراع فـي بلـد واحـد أو أكثـر ويبت كل بلد في منح الحماية بالبراءة في أراضيه من عدم منحها وتنص معاهدة التعاون بشأن البراءات التـي تـديرها الويبـو علـى إيـداع طلـب دولـي واحـد للبـراءة تكـون لـه الآثار ذاتها المترتبة على الطلبات الوطنية المودعة في البلدان المعينة. ويجوز لمودع الطلب الذي يلـتمس الحمايـة أن يـودع طلبـا واحـدا ويلـتمس الحمايـة فـي العـدد الـذي يـراه مناسـبا مـن البلـدان الموقعـة. ولا تمـنح معاهـدة التعـاون بشـأن البـراءات (بـراءة دوليـة)، ولكنهـا تبسـط فقـط إجـراءات الإيـداع والبحـث والفحـص. أمـا اختصاص منح البراءة فيعود فقط للمكاتب الوطنية أو الإقليمية كما سبق وذكرنا."

    if msg.get('entities').get('p24:p24') != None:
        if msg.get('entities').get('p24:p24')[0].get('name') == "p24":
            return conversation()
    if msg.get('entities').get('ip_registration:registration') != None:
        if msg.get('entities').get('ip_registration:registration')[0].get('name') == "ip_registration:":
            return conversation()

    if msg.get('entities').get('p25:p25') != None:
        if msg.get('entities').get('p25:p25')[0].get('name') == "p25":
            return "الحماية تبدأ من تاريخ الإيداع"
    if msg.get('entities').get('p26:p26') != None:
        if msg.get('entities').get('p26:p26')[0].get('name') == "p26":
            return " إن الجهة المختصة بالنظر في انتهاك براءات الاختراع و النماذج الصناعية هي وزارة العدل"
    if msg.get('entities').get('p27:p27') != None:
        if msg.get('entities').get('p27:p27')[0].get('name') == "p27":
            return "لا يوجد حماية فكرية للتطبيقات الحماية لأكواد البرمجة يمكنكم تسجيلها و إصدار شهادة ملكية للتطبيق على الرابط التالي: https://t.co/PCf2eZnu1s…"
    if msg.get('entities').get('p28:p28') != None:
        if msg.get('entities').get('p28:p28')[0].get('name') == "p28":
            return "عند تقديمكم للطلب مستوفي الشروط و سداد الرسوم المقررة"
    if msg.get('entities').get('p30:p30') != None:
        if msg.get('entities').get('p30:p30')[0].get('name') == "p30":
            return "الرسوم التي يتم دفعها لا تسترد"
    if msg.get('entities').get('p31:p31') != None:
        if msg.get('entities').get('p31:p31')[0].get('name') == "p31":
            return "عناصر الحماية هي ما يميز الاختراع الخاص بكم عن الاختراعات الموجودة"
    if msg.get('entities').get('p33:p33') != None:
        if msg.get('entities').get('p33:p33')[0].get('name') == "p33":
            return "يؤسفنا ان الاكتشافات و طرق معالجة جسم الإنسان، أو الحيوان جراحياً، أو علاجياً، وطرق تشخيص المرض المطبقة على جسم الإنسان أو الحيوان لا يوجد لها حقوق فكرية, ويستثنى من ذلك المنتجات التي تستعمل في أي من تلك الطرق"
    if msg.get('entities').get('p32:p32') != None:
        if msg.get('entities').get('p32:p32')[0].get('name') == "p32":
            return "حالياً لا توجد خدمة الرهن لبرءات الاختراع."
    if msg.get('entities').get('p34:p34') != None:
        if msg.get('entities').get('p34:p34')[0].get('name') == "p34":
            return "البراءات تحمى لمدة عشرون سنه وفي حال الانتهاك لبراءة مسجلة يتم رفع دعوى لدا المحاكم المختصة ."
    if msg.get('entities').get('p35:p35') != None:
        if msg.get('entities').get('p35:p35')[0].get('name') == "p35":
            return "تبدأ الحماية من تاريخ الإيداع، و الحصول على شهادة براءة الاختراع بعد اجتياز عدة مراحل يقرر الفاحص بالمنح أو الرفض."
    if msg.get('entities').get('p36:p36') != None:
        if msg.get('entities').get('p36:p36')[0].get('name') == "p36":
            return "التصاميم المعمارية محمية من تاريخ النشر لها مباشره و يمكنكم تسجيلها في  خدمة التسجيل الاختياري عبر الموقع الرسمي للهيئة على الرابط التالي : https://t.co/PCf2eZF5q2"
    if msg.get('entities').get('p37:p37') != None:
        if msg.get('entities').get('p37:p37')[0].get('name') == "p37":
            return "عناصر الحماية هي ما يميز الاختراع الخاص بكم عن الاختراعات الموجودة."
    if msg.get('entities').get('p38:p38') != None:
        if msg.get('entities').get('p38:p38')[0].get('name') == "p38":
            return "في حال انتهاك براءة الاختراع الخاصة بكم، يمكنكم التواصل مع لجنة النظر في  دعاوى براءات الاختراع و النماذج الصناعية على البريد الإلكتروني التالي : Plc@saip.gov.sa"
    if msg.get('entities').get('p39:p39') != None:
        if msg.get('entities').get('p39:p39')[0].get('name') == "p39":
            return "يوجد لدى الهيئة مسار خاص بالدارات المتكاملة و يمكنكم تسجيلها على الرابط  التالي : https://t.co/Qhv8X2DbpZ"
    if msg.get('entities').get('p40:p40') != None:
        if msg.get('entities').get('p40:p40')[0].get('name') == "p40":
            return "يمكنكم الإطلاع على أخر المستجدات عبر الدخول على حسابكم في نظام براءات الاختراع على الرابط التالي : https://t.co/tebmct0qDV"
    if msg.get('entities').get('p41:p41') != None:
        if msg.get('entities').get('p41:p41')[0].get('name') == "p41":
            return "تم تعريف المسار السريع في هذا التصميم يمكنك الاطلاع عليه ويسعدنا توصلكم https://t.co/s4t8c5wYJc https://t.co/088l5SCb79"
    if msg.get('entities').get('p42:p42') != None:
        if msg.get('entities').get('p42:p42')[0].get('name') == "p42":
            return "أهلاً بك، يمكنك تقديم دعوى أمام لجنة النظر في دعاوى براءات الاختراع بمدينة الملك عبدالعزيز للعلوم والتقنية كونها الجهة المختصة حالياً بالنماذج الصناعية."
    if msg.get('entities').get('p43:p43') != None:
        if msg.get('entities').get('p43:p43')[0].get('name') == "p43":
            return " شكراً لتواصلكم ، حماية الاختراع تكون داخل نطاق الدولة المانحة لشهادة براءة الاختراع."
    if msg.get('entities').get('p44:p44') != None:
        if msg.get('entities').get('p44:p44')[0].get('name') == "p44":
            return "يمكنكم الإطلاع على النظام و اللائحة التنفيذية لبراءات الاختراع و حق المؤلف على الرابط التالي: https://t.co/SjhmMrhCwI"
    if msg.get('entities').get('p45:p45') != None:
        if msg.get('entities').get('p45:p45')[0].get('name') == "p45":
            return "الحماية تكون في نطاق الدول التي تم التسجيل و منح براءة الاختراع فيها، و يمكنكم الاطلاع على النظام و اللائحة التنفيذية لبراءات الاختراع على الرابط التالي:https://t.co/SjhmMrhCwI"
    if msg.get('entities').get('p46:p46') != None:
        if msg.get('entities').get('p46:p46')[0].get('name') == "p46":
            return "يمكنكم الاطلاع على الرسوم من خلال اللائحة التنفيذية  على الرابط التالي: https://t.co/xNRlaTz2fH "
    if msg.get('entities').get('p47:p47') != None:
        if msg.get('entities').get('p47:p47')[0].get('name') == "p47":
            return "تبدأ الحماية من تاريخ الإيداع ، والحصول على شهادة براءة الاختراع بعد اجتياز عدة مراحل يقرر الفاحص بالمنح أو الرفض ، ويمكنكم الاطلاع على المدة النظامية من خلال اللائحة التنفيذية لنظام براءات الاختراع عبر الرابط التالي : https://t.co/aN862sq7Pw"
    if msg.get('entities').get('p48:p48') != None:
        if msg.get('entities').get('p48:p48')[0].get('name') == "p48":
            return " الرسومات ليست ألزامية للتقديم على طلب براءة اختراع "
    if msg.get('entities').get('p49:p49') != None:
        if msg.get('entities').get('p49:p49')[0].get('name') == "p49":
            return "نعم ، الإختراعات هي تطوير لإختراعات سابقة. و يمكنكم الاطلاع على النظام و اللائحة التنفيذية البراءات الاختراع : https://t.co/6z0nBgA7hv"
    return 'آسفة لم افهم سؤالك، من فضلك يرجى إعادة صياغة السؤال بطريقة أخرى'


def process_ip(msg): #intellactual property intent responses
    if msg.get('entities').get('ip1:ip1') != None:
        if msg.get('entities').get('ip1:ip1')[0].get('name') == "ip1":
            return "تعني أن الملكية أن للمالك الحرية المطلقة في استعمال ملكيته أو في منع الآخرين من استعمالها وذلك في نطاق ما يسمح به القانون، ويقتصر استعمال مصطلح الملكية الفكرية في أيامنا الحاضرة على أنواع الملكية التي يبدعها الفكر الإنساني"

    if msg.get('entities').get('ip2:ip2') != None:
        if msg.get('entities').get('ip2:ip2')[0].get('name') == "ip2":
            return "ﺑﺣﺳب اﻟﻔﻘرة اﻟﺛﺎﻣﻧﺔ ﻣن اﻟﻣﺎدة اﻟﺛﺎﻧﻳﺔ ﻣن اﺗﻔﺎﻗﻳﺔ إﻧﺷﺎء اﻟﻣﻧظﻣﺔ اﻟﻌﺎﻟﻣﻳﺔ ﻟﻠﻣﻠﻛﻳﺔ اﻟﻔﻛرﻳﺔ فتشمل هذه الحقوق ﻣﺎ ﻳﻠﻲ: - اﻟﻣﺻﻧﻔﺎت اﻷدﺑﻳﺔ واﻟﻔﻧﻳﺔ واﻟﻌﻠﻣﻳﺔ. - إﻧﺟﺎزت اﻟﻔﻧﺎﻧﻳن اﻟﻘﺎﺋﻣﻳن ﺑﺎﻷداء والفونوغرامات والتلفزيون. - اﻻﺧﺗراﻋﺎت ﻓﻲ ﺟﻣﻳﻊ ﻣﺟﺎﻻت اﻻﺟﺗﻬﺎد الإنساني. - الاكتشافات اﻟﻌﻠﻣﻳﺔ. - اﻟﺗﺻﺎﻣﻳم اﻟﺻﻧﺎﻋﻳﺔ. - العلامات اﻟﺗﺟﺎرﻳﺔ وعلامات الخدمة والأسماء والسمات التجارية. - الحماية من المنافسة غير المشروعة. وجميع الحقوق الأخرى الناتجة عن النشاط الفكري في المجالات الصناعية والعلمية والأدبية والفنية."

    if msg.get('entities').get('ip3:ip3_1') != None:
        if msg.get('entities').get('ip3:ip3_1')[0].get('name') == "ip3":
            return "العلامات التجارية."

    if msg.get('entities').get('ip3:ip3_2') != None:
        if msg.get('entities').get('ip3:ip3_2')[0].get('name') == "ip3":
            return "الحقوق المجاورة لحق المؤلف."

    if msg.get('entities').get('ip3:ip3_3') != None:
        if msg.get('entities').get('ip3:ip3_3')[0].get('name') == "ip3":
            return "براءات الاختراع"

    if msg.get('entities').get('ip3:ip3_4') != None:
        if msg.get('entities').get('ip3:ip3_4')[0].get('name') == "ip3":
            return "التصاميم الصناعية"

    if msg.get('entities').get('ip3:ip3_5') != None:
        if msg.get('entities').get('ip3:ip3_5')[0].get('name') == "ip3":
            return "المنافسة غير المشروعة."

    if msg.get('entities').get('ip4:ip4') != None:
        if msg.get('entities').get('ip4:ip4')[0].get('name') == "ip4":
            return "السبب الأول للاهتمام بحماية الملكية الفكرية هو الرغبة في تأمين العدالة التي تسمح لأي شخص بذل جهدًا ووقتا في ابتكار عمل ما بأن ينتفع ماديًا من عمله هذا. والسبب الثاني هو أن الحماية الممنوحة للملكية الفكرية تشجع المبدعين كثيرًا على القيام بمزيد من الابتكارات، نظرًا للمردود المادي لأعمالهم هذه فتنمو بذلك وتزدهر الصناعات والشركات القائمة على تلك الابتكارات."

    if msg.get('entities').get('ip3:ip3_6') != None:
        if msg.get('entities').get('ip3:ip3_6')[0].get('name') == "ip3":
            return "حماية هذا النوع من الملكية ترعاه قوانين حق المؤلف."

    if msg.get('entities').get('ip3:ip3_7') != None:
        if msg.get('entities').get('ip3:ip3_7')[0].get('name') == "ip3":
            return "حماية هذا النوع من الملكية ترعاه قوانين حق المؤلف."

    if msg.get('entities').get('ip3:ip3_8') != None:
        if msg.get('entities').get('ip3:ip3_8')[0].get('name') == "ip3":
            return "حماية هذا النوع من الملكية ترعاه قوانين الحقوق المجاورة لحق المؤلف"
    if msg.get('entities').get('ip3:ip3_9') != None:
        if msg.get('entities').get('ip3:ip3_9')[0].get('name') == "ip3":
            return "حماية هذا النوع من الملكية ترعاه قوانين الحقوق المجاورة لحق المؤلف"

    if msg.get('entities').get('ip3:ip3_10') != None:
        if msg.get('entities').get('ip3:ip3_10')[0].get('name') == "ip3":
            return "حماية الاختراعات تتم بواسطة قوانين البراءات"

    if msg.get('entities').get('ip3:ip3_11') != None:
        if msg.get('entities').get('ip3:ip3_11')[0].get('name') == "ip3":
            return "حماية التصاميم الصناعية تتم بواسطة التشريعات الخاصة بها أو من خلال قوانين الملكية الصناعية أو من خلال قانون حق المؤلف"

    if msg.get('entities').get('ip5:ip5_regulation') != None:
        if msg.get('entities').get('ip5:ip5_regulation')[0].get('name') == "ip5":
            return "تشجيع الإبداع الفكري من خلال توفير الحماية له؛ الاعتراف الرسمي بالمبدعين؛ خلق بنوك للمعلومات تتضمن معلومات حيوية؛ تسهيل نمو الصناعة والثقافة المحلية والتجارة الدولية من خلال المعاهدات التي تقدم الحماية المتعددة الأطراف"

    if msg.get('entities').get('ip6:ip6_resources') != None:
        if msg.get('entities').get('ip6:ip6_resources')[0].get('name') == "ip6":
            return "للتعمق في هذا الموضوع وللمزيد من المراجع يمكن زيارة الموقعين التالين https://www.wipo.int/about-ip/en والموقع http://www.wipo.int/ar/treaties/index.html "

    if msg.get('entities').get('ip7:ip7_trespass') != None:
        if msg.get('entities').get('ip7:ip7_trespass')[0].get('name') == "ip7":
            return "في حال اكتشفت أنه تم التعدي على حقوق الملكية الفكرية الخاصة بك، ننصحك باللجوء إلى محامي أو مؤسسة مختصة بإنفاذ الحقوق في بلدك"

    if msg.get('entities').get('idea:idea') != None:
        if msg.get('entities').get('idea:idea')[0].get('name') == "idea":
            return "الأفكار المجردة مستثناة من الحماية بموجب النظام، وعنذ تطبيقها يحمى التعبير عنها وليست الفكرة نفسها. ويمكنك الاطلاع على النظام واللائحة التنفيذية على الرابط التالي: https://www.saip.gov.sa/ar/laws-regulations/"

    if msg.get('entities').get('ip_authority:authority') != None:
        if msg.get('entities').get('ip_authority:authority')[0].get('name') == "ip_authority":
            return " الهيئة تهدف إلى تنظيم مجالات الملكية الفكرية في المملكة، ودعمها، وتنميتها، ورعايتها، وحمايتها، وانفاذها، والارتقاء بها وفق أفضل الممارسات العالمية وهي أحد مبادرات رؤية المملكة ٢٠٣٠ حيث صدرت موافقة مجلس الوزراء بنقل اختصاص براءات الاختراع والعلامات التجارية وحقوق المؤلف للهيئة"

    if msg.get('entities').get('ip_tweet:tweet') != None:
        if msg.get('entities').get('ip_tweet:tweet')[0].get('name') == "ip_tweet":
            return " التغريدات الإبداعية محميه لأصحابها، ويستثنى الكلام العام أو الرأي العام وماشابهه"

    if msg.get('entities').get('ip_fields:fields') != None:
        if msg.get('entities').get('ip_fields:fields')[0].get('name') == "ip_fields":
            return "العلامات التجارية، حقوق المؤلف، براءات الاختراع، النماذج الصناعية، الأصناف النباتية، وغيرها من المجالات...  وكل هذه التفاصيل موجودة في موقعنا حياك https://t.co/auFD913Kxd   :مجالات حقوق الملكية الفكرية تشمل"

    if msg.get('entities').get('ip_registration:registration') != None:
        if msg.get('entities').get('ip_registration:registration')[0].get('name') == "ip_registration":
            return """يمكنك التسجيل لـ:
1 - البراءات (التصاميم المعمارية، النماذج الصناعية، الأصناف النباتية، التطبيقات الإلكترونية، تصاميم الدارات المتكاملة) عن طريق الرابط: epatentsso.saip.gov.sa 
2- الاعمال المحمية بنظام حقوق المؤلف والحقوق المجاورة عن طريق الرابط: copyright.saip.gov.sa
3-  العلانات التجارية عن طريق الرابط: tm.saip.gov.sa
4- ترخيص ممارسة أنشطة الملكية الفكرية عن طريق الرابط: agent.saip.gov.sa """

    if msg.get('entities').get('ip_geographicLoc:geographicLoc') != None:
        if msg.get('entities').get('ip_geographicLoc:geographicLoc')[0].get('name') == "ip_geographicLoc":
            return " النطاق الجغرافي للحماية يختلف حسب مجالات الملكية الفكرية، على سبيل المثال لا يوجد شهادة دولية تحمي براءة الاختراع بجميع دول العالم، اما حق المؤلف فهو محمي تلقائياً بجميع دول العالم، والعلامة التجارية تحمى بالدولة المسجل بها وبالفئة المختارة"

    if msg.get('entities').get('ip_enforcement:enforcement') != None:
        if msg.get('entities').get('ip_enforcement:enforcement')[0].get('name') == "ip_enforcement":
            return """ ينص اتفاق تريبس ومعه القوانين الوطنية على مجموعة من آليات الإنفاذ الفعالة وهي:
        - التدابير المؤقتة، كالبحث ومصادرة السلع التي يشتبه في أنها متعدية والمعدات المستخدمة في صنع هذه السلع
         - الإجراءات المدنية كدفع التعويضات المالية وإتلاف السلع المتعدية
          - الأوامر القضائية لكف التعدي الحاصل أو لتفادي حصوله
           - الإجراءات الجنائية كالحبس والغرامة
           - التدابير الحدودية لوقف الإفراج عن السلع المستوردة التي يظن أنها منتحلة ومنع تداولها"""

    if msg.get('entities').get('ip_traditionKnowladge:traditionKnowladge') != None:
        if msg.get('entities').get('ip_traditionKnowladge:traditionKnowladge')[0].get(
                'name') == "ip_traditionKnowladge":
            return "يسعى العديد من أصحاب المعارف التقليدية إلى إدراج المعارف التقليدية وأشكال التعبير الثقافي في إطار من التنمية الاقتصادية والاجتماعية المستدامة، من خلال اللجوء إلى مختلف نهج الملكية الفكرية، بما في ذلك قوانين البراءات والعلامات التجارية وحق المؤلف. ويستعين أصحاب المعارف التقليدية كذلك بما يسمى بالقوانين الخاصة أو المصاغة خصيصا لحماية المعارف التقليدية، أو أشكال التعبير التقليدي الثقافي، أو الفلكلور، حيث وجدت"

    if msg.get('entities').get('ip_geneticResources:geneticResources1') != None:
        if msg.get('entities').get('ip_geneticResources:geneticResources1')[0].get('name') == "ip_geneticResources":
            return "الموارد الوراثية ذات القيمة الفعلية أو المحتملة، بما فيها عناصر التنوع البيولوجي في وضعها الطبيعي، والأصناف والسلالات الحديثة أو التقليدية المستخدمة في الزراعة، والأصول الوراثية الخاصة"

    if msg.get('entities').get('ip_geneticResources:geneticResources2') != None:
        if msg.get('entities').get('ip_geneticResources:geneticResources2')[0].get('name') == "ip_geneticResources":
            return "يمكن أن تساهم الموارد الوراثية مساهمة مهمة في البحث والتطوير الابتكار منتجات جديدة، وذلك في عدد متزايد من القطاعات التكنولوجية والصناعية. ومن المسائل البالغة الأهمية في هذا الصدد، شروط النفاذ إلى الموارد الوراثية، والتزام موفري الموارد الوراثية بمبدأ الموافقة المسبقة والمستنيرة، وما يترتب على ذلك من تدابير لاقتسام المنافع التي يثرها استخدام الموارد الوراثية وتنميتها"

    if msg.get('entities').get('ip_geneticResources:geneticResources3') != None:
        if msg.get('entities').get('ip_geneticResources:geneticResources3')[0].get('name') == "ip_geneticResources":
            return "أتاحت القوانين الدولية وعدد من القوانين واللوائح الإقليمية والوطنية ودون الوطنية، وضع إطار التطبيق مبدأ الموافقة المسبقة والمستنيرة للنفاذ إلى الموارد الوراثية، وتحديد شروط هذا النفاذ، لا سيما ضمان استخدام هذه الموارد استخدامة مستدامة واقتسام منافعه بإنصاف. وتشمل العناصر الرئيسية من القانون الدولي، اتفاقية التنوع البيولوجي والمعاهدة الدولية بشأن الموارد الوراثية النباتية للأغذية والزراعة التابعة لمنظمة الأغذية والزراعة. وفي إطار الاتفاقات المبرمة بشأن النفاذ إلى الموارد الوراثية واقتسام المنافع والنظم القانونية التي تتيح هذا النفاذ، تكتسي التدابير الخاصة المتصلة بإدارة الملكية الفكرية أهمية بالغة لأنها تضمن مراعاة هذه الاتفاقات لضرورة أن يعود النفاذ إلى الموارد الوراثية بمنافع محددة، وتكفل الاقتسام المنصف لهذه المنافع والاحترام التام لمصالح ومشاغل موفري هذه الموارد"

    return 'آسفة لم افهم سؤالك، من فضلك يرجى إعادة صياغة السؤال بطريقة أخرى'


def process_ic(msg): #integrted circuits intent responses
    if msg.get('entities').get('i1:i1') != None:
        if msg.get('entities').get('i1:i1')[0].get('name') == "i1":
            return "هو منتج يكون الغرض منه أداء وظيفة إلكترونية، تشكل فيه العناصر – يكون أحدها على الأقل نشطاً – وجميع الوصلات، أو بعضها شكلاً متكاملاً في قطعة من المادة أو عليها، سواءً في شكله النهائي أو الوسيط."
    if msg.get('entities').get('i2:i2') != None:
        if msg.get('entities').get('i2:i2')[0].get('name') == "i2":
            return "يجوز طلب تسجيل التصميم لدارة متكاملة إذا لم يكن التصميم قد استغل استغلالًا تجاريٍا بعد ، أو كان موضع استغلال تجاري فترة لا تتجاوز السنتين في أي مكان في العالم ."
    if msg.get('entities').get('i3:i3') != None:
        if msg.get('entities').get('i3:i3')[0].get('name') == "i3":
            return "١ -تعبئة نموذج طلب شهادة تصميم تخطيطي لدارة متكاملة المعد لذلك .٢ -إرفاق وصف مختصر ودقيق للتصميم، يشتمل على المعلومات التي تعرف الوظيفة الالكترونية التي تؤديها الدارة المتكاملة.٣ - إرفاق رسمة أو صورة واضحة للتصميم ، ويمكن استبعاد أجزاء الرسمة أو الصورة المتعلقة بطريقة صنع الدائرة المتكاملة بشرط أن تكون الأجزاء المقدمة كافية لتوضيح التصميم وتحديده.٤- إرفاق عينة للدارة المتكاملة إذا كانت موضع استغلال تجاري، في حال طلب الهيئة لها.٥- يجب أن تكون الوثائق المقدمة نسخة أصلية أو مصدقا عليها من الجهات ذات الاختصاص.٦- سداد المقابل المالي للإيداع.٧- يجب على مقدم الطلب أن يستوفي كل ما تطلبه الهيئة مما له علاقة بالطلب."
    if msg.get('entities').get('i4:i4') != None:
        if msg.get('entities').get('i4:i4')[0].get('name') == "i4":
            return "يحق لمالك الشهادة رفع شكوى عدا في حال ان من باشرها أو أمر بالقيام بها لم يكن يعلم أو لـيس لديـه أسـباب معقولـة للعلم- عنــد حصــوله علــى الــدارة المتكاملــة ، أو الســلعة المتضــمنة لهــذه الــدارة بأنها تحتـوي علـى تصـميم منسـوخ بطريقـة غيـر مشـروعة إلا انه يجب ان يدفع لمالك شهادة التصميم تعويضات عادلة تقدرها اللجنة. "
    if msg.get('entities').get('i7:i7') != None:
        if msg.get('entities').get('i7:i7')[0].get('name') == "i7":
            return "هو الترتيب الثلاثي الأبعاد لعناصر دارة متكاملة – على أن يكون أحد تلك العناصر على الأقل نشطاً -، ولجميع الوصلات، أو بعضها، أو الترتيب الثلاثي الأبعاد المعد لدارة متكاملة بغرض التصنيع."
    if msg.get('entities').get('i8:i8') != None:
        if msg.get('entities').get('i8:i8')[0].get('name') == "i8":
            return "مدة حماية شهادة التصميم عشر سنوات من تاريخ إيداع الطلب, أو عشر سنوات من تاريخ بدء استغلاله تجارياً في أي مكان في العالم, وفي كل الأحوال لايجوز أن تتعدى مدة الحماية خمس عشرة سنة من تاريخ التوصل إلى التصميم."

    return 'آسفة لم افهم سؤالك، من فضلك يرجى إعادة صياغة السؤال بطريقة أخرى'


def process_im(msg): #industrial design intent responses
    if msg.get('entities').get('m1:m1') != None:
        if msg.get('entities').get('m1:m1')[0].get('name') == "m1":
            return "التصميم الصناعي هو الجانب الزخرفي أو الجمالي من سلعة مفيدة. وقد يتخذ شكلاً مجسمًا مثل هيئة السلعة أو سطحها، أو شكلاً مسطحًا مثل الأنماط أو الخطوط أو الألوان"
    if msg.get('entities').get('m2:m2') != None:
        if msg.get('entities').get('m2:m2')[0].get('name') == "m2":
            return "النموذج او الرسم الصناعي هو المظهر الزخرفي أو الجمالي لسلعة ما، ومـن الممكـن أن يتـألف مـن عناصـر مجسـمة مثـل شـكل السـلعة أو سـطحها أو مـن عناصـر ثنائيـة الأبعـاد مثـل الرسوم أو الخطوط أو الألوان"
    if msg.get('entities').get('m3:m3') != None:
        if msg.get('entities').get('m3:m3')[0].get('name') == "m3":
            return "تمنح حماية التصميم الصناعي صاحب الحماية حق منع الغير من نسخ أو تقليد التصميم الصناعي دون تصريح، وبعبارة أخرى يمكن لصاحب الحق أن يمنع الآخرين من صنع أو استيارد أو تصدير أو بيع أي منتج يتضمن هذا التصميم الصناعي من دون تصريحه"
    if msg.get('entities').get('m4:m4') != None:
        if msg.get('entities').get('m4:m4')[0].get('name') == "m4":
            return """• للمساعدة على ضمان عائد عادل من الاستثمار.
           • لتشجيع المنافسة المشروعة والممارسات التجارية الشريفة ضد النسخ والتقليد.
            • للمساهمة فـي توسـيع القيمـة التجاريـة للشـركات، فالرسـم أو النمـوذج الصـناعي النـاجح يعتبـر مـن الأصـول التجارية للشركة.
              • لتشجيع الإبداع في قطاع الصناعات والفنون التقليدية والحرف اليدوية"""
    if msg.get('entities').get('m6:m6') != None:
        if msg.get('entities').get('m6:m6')[0].get('name') == "m6":
            return "تقتضي معظم القوانين الوطنية أن يكون جديدا أو أصليا وألا تمليه وظيفته. ويعني ذلك أنه يتسم أساسا بطابع جمالي ولا تحمى فيه أية عناصر تقنية للسلعة التي يطبق عليها."
    if msg.get('entities').get('m7:m7') != None:
        if msg.get('entities').get('m7:m7')[0].get('name') == "m7":
            return "فـي معظـم البلـدان، لا بـد مـن تسـجيل الرسـم أو النمـوذج الصـناعي حتـى يحظـى بالحمايـة"
    if msg.get('entities').get('m8:m8') != None:
        if msg.get('entities').get('m8:m8')[0].get('name') == "m8":
            return "هنـاك اخـتلاف بـين البلـدان بشـأن تعريـف المصـطلح وبـين إجـراءات التسـجيل نفسـها. وبصـورة عامـة، يعنـي مصـطلح 'جديد' أن الرسـم لـم يسـبقه رسـم مطـابق أو مشـابه لـه ومعـروف مـن ذي قبـل."
    if msg.get('entities').get('m9:m9') != None:
        if msg.get('entities').get('m9:m9')[0].get('name') == "m9":
            return "فـي بعض البلـدان يمكـن أن تشـمل الحمايـة النمـوذج الصـناعي وحـق المؤلـف فـي وقـت واحـد. وفي بلـدان أخـرى، تلغـي الواحـدة الأخـرى، أي أن مالـك الحـق لا يمكنـه أن يتمسـك بنـوع مـن الحمايـة بمجرد اختياره النوع الآخر."
    if msg.get('entities').get('m10:m10') != None:
        if msg.get('entities').get('m10:m10')[0].get('name') == "m10":
            return "تكفل الحماية لصاحب الرسم أو النموذج الصناعي حقًا استئثاريًا بمنع استنساخ أو تقليد الرسم أو النموذج الصناعي من قبل الغير بدون تصريح. وهذا الحق الاستئثاري يتضمن حق صنع واستيراد وتصدير وبيع أي منتج يتضمن هذا الرسم أو النموذج الصناعي. ويمكن لصاحب الرسم أن يرخص أو يسمح للغير باستعمال رسمه أو تصميمه كما يمكنه أن يبيع حقه الاستئثاري للغير."
    if msg.get('entities').get('m11:m11') != None:
        if msg.get('entities').get('m11:m11')[0].get('name') == "m11":
            return "يمكنكم حمايتها عبر تسجيلها في نظام النماذج الصناعية على الرابط التالي: https://t.co/7r8LXVHCTv"

    return 'آسفة لم افهم سؤالك، من فضلك يرجى إعادة صياغة السؤال بطريقة أخرى'


def process_tm(msg): #trademark intent responses
    if msg.get('entities').get('t_1:t_1') != None:
        if msg.get('entities').get('t_1:t_1')[0].get('name') == "t_1":
            return "يجب أخذ الموافقة الخطية من صاحب العلامة التجارية"
    if msg.get('entities').get('t_2:t_2') != None:
        if msg.get('entities').get('t_2:t_2')[0].get('name') == "t_2":
            return " على الرابط التالي: يتم تقديم الشكوى عبر نظام العلامات التجارية https://t.co/auFD913Kxd"
    if msg.get('entities').get('t_3:t_3') != None:
        if msg.get('entities').get('t_3:t_3')[0].get('name') == "t_3":
            return "التظلم من قرار رفض تسجيل علامة او تعليقة على شرط يتم برسوم ١٠٠٠ ريال، ويمكن الاطلاع على الرسوم المختلفة عبر النظام و'اللائحة التنفيذية لنظام العلامات التجارية' عبر الرابط التالي: https://t.co/nOy7lvjaxW "
    if msg.get('entities').get('t_4:t_4') != None:
        if msg.get('entities').get('t_4:t_4')[0].get('name') == "t_4":
            return "تحت الإجراءات يكون الطلب في فترةالنشر 60 يوم، ويجب الانتظار حتى نهاية الفترة"
    if msg.get('entities').get('t_5:t_5') != None:
        if msg.get('entities').get('t_5:t_5')[0].get('name') == "t_5":
            return "يمكنكم الدخول على نظام العلامات التجارية و معرفة رقم الفاتورة بالضغط على رقم الطلب او برمز فواتير النشر 144 (خدمات أعمالي) ، ومن ثم السداد على الرقم المفوتر 242"
    if msg.get('entities').get('t48:t48') != None:
        if msg.get('entities').get('wit$location:location') != None or msg.get('entities').get(
                'ip_geographicLoc:geographicLoc') != None:
            if msg.get('entities').get('t48:t48')[0].get('name') == "t48":
                return "يمكنكم التقديم على علامة تجارية عبر مكتب محاماة معتمد"
    if msg.get('entities').get('t_7:t_7') != None:
        if msg.get('entities').get('t_7:t_7')[0].get('name') == "t_7":
            return "يمكن تسجيل علامات تجارية متعددة تحت سجل مؤسسة تجارية واحدة"
    if msg.get('entities').get('t_9:t_9') != None:
        if msg.get('entities').get('t_9:t_9')[0].get('name') == "t_9":
            return "لايحق المطالبة بتغيير الاسم التجاري وفي حال كانت العلامة قيد التسجيل يمكن الأعتراض عليها، وفي حال كانت مسجلة بالإمكان التوجه بموجب النظام الى المحاكم المختصة"
    if msg.get('entities').get('t_10:t_10') != None:
        if msg.get('entities').get('t_10:t_10')[0].get('name') == "t_10":
            return "المتوفر حالياً باللغة العربية فقط، يمكنكم الترجمة من مكتب ترجمة معتمد"
    if msg.get('entities').get('t_11:t_11') != None:
        if msg.get('entities').get('t_11:t_11')[0].get('name') == "t_11":
            return "لا يجوز تسجيل العلامة التي تحمل أسماء مدن او دول او بيانات جغرافية، حيث انه لايمكن حمايتها"

    if msg.get('entities').get('t_14:t_14') != None:
        if msg.get('entities').get('t_14:t_14')[0].get('name') == "t_14":
            return "يجب أن يكون تسجيل العلامة التجارية على السجل التجاري ليتم ممارسة النشاط التجاري لها"
    if msg.get('entities').get('t_15:t_15') != None:
        if msg.get('entities').get('t_15:t_15')[0].get('name') == "t_15":
            return "يمكنكم تقديم طلب تعديل بيانات من خلال النظام لصورة العلامة بحيث أن لا يكون التغيير جوهري"
    if msg.get('entities').get('t_16:t_16') != None:
        if msg.get('entities').get('t_16:t_16')[0].get('name') == "t_16":
            return "لا يوجد مكتب محدد يمكنكم اختيار اي مكتب ترجمة معتمد"
    if msg.get('entities').get('t_17:t_17') != None:
        if msg.get('entities').get('t_17:t_17')[0].get('name') == "t_17":
            return "يتم إصدار الفاتورة خلال أقل من ٢٤ ساعة بالموقع الإلكتروني"
    if msg.get('entities').get('t_18:t_18') != None:
        if msg.get('entities').get('t_18:t_18')[0].get('name') == "t_18":
            return "يمكن تقديم طلب نقل ملكية للعلامة التجارية التابعة للمؤسسة عبر النظام الإلكتروني"
    if msg.get('entities').get('t_19:t_19') != None:
        if msg.get('entities').get('t_19:t_19')[0].get('name') == "t_19":
            return "تُنشر العلامات التجارية في صحيفة الملكية الفكرية و يمكنكم الاطلاع عليها من خلال الرابط :https://ipn.saip.gov.sa"
    if msg.get('entities').get('t_20:t_20') != None:
        if msg.get('entities').get('t_20:t_20')[0].get('name') == "t_20":
            return "لا يتم استخدام العلامة التجارية إلا بعد انتهاء فترة النشر و الحصول على الشهادة، لكن يمكنكم طلب شهادة الإيداع و تقديمها للجهات الحكومية و الغير حكومية التي تطلب هذة الشهادة أثناء فترةالنشر "
    if msg.get('entities').get('t_21:t_21') != None:
        if msg.get('entities').get('t_21:t_21')[0].get('name') == "t_21":
            return "تسجيل العلامة التجارية لا يتطلب سجل تجاري حيث بالإمكان تقديم الطلب بإسم شخصي"
    if msg.get('entities').get('t_22:t_22') != None:
        if msg.get('entities').get('t_22:t_22')[0].get('name') == "t_22":
            return "عقد التنازل من مالك العلامة، يحتوي على (اسم العلامة,رقمها,تاريخها, فئتها) على مطبوعاته ومصدق من الغرفة التجارية. ولا توجد صيغة موحدة للتنازل"
    if msg.get('entities').get('t_23:t_23') != None:
        if msg.get('entities').get('t_23:t_23')[0].get('name') == "t_23":
            return "يكتب االعقد بالطريقة التي تناسب جميع الأطراف"
    if msg.get('entities').get('t_24:t_24') != None:
        if msg.get('entities').get('t_24:t_24')[0].get('name') == "t_24":
            return " التقديم يكون باللغة العربية أو اللغة الإنجليزية فقط "
    if msg.get('entities').get('t_25:t_25') != None:
        if msg.get('entities').get('t_25:t_25')[0].get('name') == "t_25":
            return "التسجيل غير إلزامي"
    if msg.get('entities').get('t_26:t_26') != None:
        if msg.get('entities').get('t_26:t_26')[0].get('name') == "t_26":
            return " يمكنكم الاطلاع على النظام و اللائحة التنفيذية لنظام العلامات التجارية على الرابط التالي : https://t.co/6z0nBgA7hv"
    if msg.get('entities').get('t_27:t_27') != None:
        if msg.get('entities').get('t_27:t_27')[0].get('name') == "t_27":
            return "عنداختلاف نشاط العلامات التجارية يمكن التسجيل باسماء مشابهه او مطابقة ، و يمكنكم الاطلاع النظام و اللائحة التنفيذية على الرابط التالي: https://t.co/SjhmMrhCwI"
    if msg.get('entities').get('t_28:t_28') != None:
        if msg.get('entities').get('t_28:t_28')[0].get('name') == "t_28":
            return "كل علامة تجارية لها رسوم خاصة بها"
    if msg.get('entities').get('t_29:t_29') != None:
        if msg.get('entities').get('t_29:t_29')[0].get('name') == "t_29":
            return "الفرق الأساسي بين التصميم الصناعي والعلامة التجارية هو أن التصميم الصناعي يجب أن يتحقق فيه أولاً الجانب الزخرفي دون جانب التمييز بالضرورة الذي هو شرط أساسي لحماية العلامات التجارية. أما العلامة التجارية، وبالرغم من أنها تتكون من مختلف أنواع الرموز الظاهرة، الزخرفية منها أو غير الزخرفية، فيجب أن تكون دائمًا مميزة، أي بعبارة أخرى يجب أن تكون دائمًا قادرة على تمييز سلع شركة أو خدماتها عن سلع غيرها من الشركات وخدماتها. ومن هنا فإن وظائف ومسوغات حماية التصاميم الصناعية تختلف عن وظائف ومسوغات حماية العلامات التجارية"
    if msg.get('entities').get('t_34:t_34') != None:
        if msg.get('entities').get('t_34:t_34')[0].get('name') == "t_34":
            return "أكثر الطرق المتبعة شيوعاً لحماية العلامة التجارية هو تسجيلها في سجل العلامات التجارية. الكثير من البلدان تجعل من هذا التسجيل شرطاً لحماية العلامة التجارية حيث يجب أن يتم تسجيل العلامة أولاً وبمجرد تسجيلها تحصل على الحماية ويصبح لمالكها الحق في منع الآخرين من استخدامها. ولكن التسجيل ليس الوسيلة الوحيدة لحماية العلامة التجارية، فالعلامات التجارية غير المسجلة تتمتع هي أيضاً بالحماية في بعض البلدان ولكن هذا النوع من الحماية لا يعوّل عليه كثيرًا والسبب هو أن العلامة التجارية غير المسجلة لا يمكن أن تتمتع بالحماية إذا لم تكتسب طابعًا مميزًا كافياً وسمعة جيدة في السوق وهذا الأمر يتطلب فترة طويلة من الزمن بعد طرح العلامة التجارية في التداول"

    if msg.get('entities').get('t1:t1') != None:
        if msg.get('entities').get('t1:t1')[0].get('name') == "t1":
            return "يمكنكم تقديم طلب البحث عن العلامة المسجلة عبر الدخول لحسابكم في بوابة العلامات التجارية على الرابط التالي : https://t.co/DX4iOawG0F…"
    if msg.get('entities').get('t2:t2') != None:
        if msg.get('entities').get('t2:t2')[0].get('name') == "t2":
            return "نفيدكم بأنه إذا لم يتم السداد خلال ٣٠ يوم من تاريخ صدور الفاتورة يعتبر الطلب متنازل عنه. و يمكنكم تقديم طلب تسجيل العلامة التجارية من جديد"
    if msg.get('entities').get('t3:t3') != None:
        if msg.get('entities').get('t3:t3')[0].get('name') == "t3":
            return "يمكنكم استخدام العلامة التجارية في حال كانت جميع المنتجات في نفس الفئة"
    if msg.get('entities').get('t5:t5') != None:
        if msg.get('entities').get('t5:t5')[0].get('name') == "t5":
            return "يمكنكم الدفع برقم الفاتورة عن طريق رمز المفوتر لسداد رقم 242 و رمز فواتير النشر 144 ( خدمات أعمالي )"
    if msg.get('entities').get('t6:t6') != None:
        if msg.get('entities').get('t6:t6')[0].get('name') == "t6":
            return "يمكنكم الدفع برقم الفاتورة عن طريق رمز المفوتر لسداد رقم 242 و رمز فواتير النشر 144 ( خدمات أعمالي )"
    if msg.get('entities').get('t7:t7') != None:
        if msg.get('entities').get('t7:t7')[0].get('name') == "t7":
            return " يجب تقديم طلب نقل ملكية العلامة التجارية قبل شطب السجل، و يمكنكم الإطلاع على تفاصيل الخدمة عبر الرابط التالي: يسعدنا تواصلكم... https://t.co/lraelYy8LK "
    if msg.get('entities').get('t8:t8') != None:
        if msg.get('entities').get('t8:t8')[0].get('name') == "t8":
            return "يمكنكم تقديم طلب تعديل بيانات للعلامة التجارية عبر النظام الإلكتروني."
    if msg.get('entities').get('t10:t10') != None:
        if msg.get('entities').get('t10:t10')[0].get('name') == "t10":
            return " العلامة التجارية مدة الحماية لها ١٠ سنوات."
    if msg.get('entities').get('t12:t12') != None:
        if msg.get('entities').get('t12:t12')[0].get('name') == "t12":
            return "الحمايه على الفئه التي تم التسجيل عليها  وفي حال رغبتكم في حماية العلامه على فئه اخرى يمكنكم طلب تسجيل علامه تجاريه وسيتم دراسة الطلب"
    if msg.get('entities').get('t13:t13') != None:
        if msg.get('entities').get('t13:t13')[0].get('name') == "t13":
            return "نعم يمكنكم التقديم باللغة العربية فقط."
    if msg.get('entities').get('t14:t14') != None:
        if msg.get('entities').get('t14:t14')[0].get('name') == "t14":
            return "يمكنكم تقديم طلب نقل ملكية عبر نظام العلامات التجارية على الرابط التالي: https://t.co/nOy7lvjaxW"
    if msg.get('entities').get('t15:t15') != None:
        if msg.get('entities').get('t15:t15')[0].get('name') == "t15":
            return "تسجيل العلامة التجارية اختياري."
    if msg.get('entities').get('t16:t16') != None:
        if msg.get('entities').get('t16:t16')[0].get('name') == "t16":
            return "يمكنكم تقديم طلب التظلم عبر الموقع الإلكتروني لنظام العلامات التجارية."
    if msg.get('entities').get('t19:t19') != None:
        if msg.get('entities').get('t19:t19')[0].get('name') == "t19":
            return "نود إفادتكم بأن التقديم على تسجيل العلامة التجارية يكون عبر مكتب محاماة معتمد للأفراد و الشركات غير السعوديين"
    if msg.get('entities').get('t20:t20') != None:
        if msg.get('entities').get('t20:t20')[0].get('name') == "t20":
            return "رسوم تقديم الطلب 1000 ريال وعند قبول الطلب ينشر الكترونيًا بعد دفع رسوم النشر 1575 ريال وعند عدم وجود اعتراض تصدر الفاتورة النهائية وهي 5000 ريال"
    if msg.get('entities').get('t22:t22') != None:
        if msg.get('entities').get('t22:t22')[0].get('name') == "t22":
            return " (نظام العلامات التجارية) يجب التقديم على طلب نقل ملكية للعلامة التجارية من المالك السابق إلى المالك الجديد عبر الموقع الإلكتروني "
    if msg.get('entities').get('t23:t23') != None:
        if msg.get('entities').get('t23:t23')[0].get('name') == "t23":
            return "يمكنكم استخدام العلامة في جميع مناطق المملكة"
    if msg.get('entities').get('t24:t24') != None:
        if msg.get('entities').get('t24:t24')[0].get('name') == "t24":
            return "كل طلب جديد يُدرس و يتم الرد عليه بشكل رسمي عبر الموقع الإلكتروني لنظام العلامات التجارية."
    if msg.get('entities').get('t25:t25') != None:
        if msg.get('entities').get('t25:t25')[0].get('name') == "t25":
            return "يتم دراسة الطلب خلال ١٤ يوم من تاريخ التقديم."
    if msg.get('entities').get('t27:t27') != None:
        if msg.get('entities').get('t27:t27')[0].get('name') == "t27":
            return "يمكنكم تجديد العلامة الخاصة بكم عبر نظام العلامات التجارية عبر الرابط التالي : https://t.co/nOy7lvjaxW علماً أنه يجب تحديث بيانات العلامة قبل التجديد."
    if msg.get('entities').get('t29:t29') != None:
        if msg.get('entities').get('t29:t29')[0].get('name') == "t29":
            return "يمكنكم اخيار الفئة المناسبة لكم حسب نشاطكم التجاري."
    if msg.get('entities').get('t31:t31') != None:
        if msg.get('entities').get('t31:t31')[0].get('name') == "t31":
            return "نعم"
    if msg.get('entities').get('t32:t32') != None:
        if msg.get('entities').get('t32:t32')[0].get('name') == "t32":
            return "يمكنكم الدخول على حسابكم بنظام العلامات التجارية و الإطلاع العلامات التجارية عبر الرابط التالي: https://t.co/nOy7lvjaxW"
    if msg.get('entities').get('t33:t33') != None:
        if msg.get('entities').get('t33:t33')[0].get('name') == "t33":
            return "يمكنكم التواصل معنا عبر البريد الإلكتروني التالي: saip@saip.gov.sa وسيتم إرسال ملف تصنيف الفئات لكم."
    if msg.get('entities').get('t34:t34') != None:
        if msg.get('entities').get('t34:t34')[0].get('name') == "t34":
            return "تمت الموافقة على طلبكم بالحماية للعلامة بمجموعها، تعني لا يمكن أستخدام أحد مكونات العلامة بشكل منفصل."
    if msg.get('entities').get('t35:t35') != None:
        if msg.get('entities').get('t35:t35')[0].get('name') == "t35":
            return "استخدام العلامة يكون كما هو موجود بالشهادة."
    if msg.get('entities').get('t37:t37') != None:
        if msg.get('entities').get('t37:t37')[0].get('name') == "t37":
            return "شهادة الإيداع خدمة اختيارية، يمكنكم سداد رسومها و تقديمها للجهات الحكومية و الغير حكومية التي تطلب هذة الشهادة أثناء فترة النشر."
    if msg.get('entities').get('t38:t38') != None:
        if msg.get('entities').get('t38:t38')[0].get('name') == "t38":
            return "إذا كانت العلامة التجارية باللغة العربية، يمكنكم تخطى هذة المتطلبات"
    if msg.get('entities').get('t39:t39') != None:
        if msg.get('entities').get('t39:t39')[0].get('name') == "t39":
            return "لا يجب عليكم التسجيل مرة أخرى، يمكنكم الدخول على حسابكم بنظام العلامات التجارية و الإطلاع على العلامة مسجلة عبر الرابط التالي: https://t.co/nOy7lvjaxW"
    if msg.get('entities').get('t40:t40') != None:
        if msg.get('entities').get('t40:t40')[0].get('name') == "t40":
            return "يجب أن تنطبق شروط تسجيل الأسماء العائلية على الطلب، و يمكنكم التواصل معنا عبر البريد الإلكتروني لمعرفة الشروط: saip@saip.gov.sa"
    if msg.get('entities').get('t44:t44') != None:
        if msg.get('entities').get('t44:t44')[0].get('name') == "t44":
            return "العلامات المتشابهه والمطابقة لعلامات مسجله على نفس الفئه لايمكن تسجليها "
    if msg.get('entities').get('t46:t46') != None:
        if msg.get('entities').get('t46:t46')[0].get('name') == "t46":
            return "استناداً للمادة ٢٤ من نظام العلامات التجارية يمكنكم تقديم دعوى شطب "
    if msg.get('entities').get('t47:t47') != None:
        if msg.get('entities').get('t47:t47')[0].get('name') == "t47":
            return "مدة الفاتورة ٣٠ يوم من تاريخ الاصدار."
    if msg.get('entities').get('t48:t48') != None:
        if msg.get('entities').get('t48:t48')[0].get('name') == "t48":
            return "يمكنكم تقديم طلب تسجيل العلامة التجارية الخاصة بكم عبر الرابط التالي: https://t.co/nOy7lvjaxW"
    if msg.get('entities').get('t50:t50') != None:
        if msg.get('entities').get('t50:t50')[0].get('name') == "t50":
            return "يتم سداد رسوم التسجيل النهائي بعد مرحلة النشر ."
    if msg.get('entities').get('t51:t51') != None:
        if msg.get('entities').get('t51:t51')[0].get('name') == "t51":
            return "رسوم التجديد تدفع كل 10 سنوات"
    if msg.get('entities').get('t52:t52') != None:
        if msg.get('entities').get('t52:t52')[0].get('name') == "t52":
            return "تُنشر العلامات التجارية في صحيفة الملكية الفكرية و يمكنكم الاطلاع عليها من خلال الرابط :https://ipn.saip.gov.sa"
    if msg.get('entities').get('t55:t55') != None:
        if msg.get('entities').get('t55:t55')[0].get('name') == "t55":
            return "من متطلبات تسجيل العلامة التجارية إرفاق ترجمة للكلمات أو العناصر الغير عربية من مكتب ترجمة معتمد، و يتم تزويدنا بطريقة نطق الكلمة اذا كانت ليس لها معنى."
    if msg.get('entities').get('t57:t57') != None:
        if msg.get('entities').get('t57:t57')[0].get('name') == "t57":
            return "يمكنكم تسجيل العلامة التجارية على السجل التجاري الخاص بكم عبر الموقع الإلكتروني التالي: https://t.co/nOy7lvjaxW"
    if msg.get('entities').get('t58:t58') != None:
        if msg.get('entities').get('t58:t58')[0].get('name') == "t58":
            return "خاصيتان أساسيتان يجب أن تتوافرا في العلامة التجارية هما: أن تكون مميزة وألا تكون خادعة "
    if msg.get('entities').get('t_32:t_32') != None:
        if msg.get('entities').get('t_32:t_32')[0].get('name') == "t_32":
            return "في الكثير من الأحيان، تعتبر العلامة التجارية خادعة إذا كانت تضلل الزبائن بإيحائها أن البضائع موضوع الحماية تتميز بصفات نوعية تكون غير موجودة فعليًا. وخير مثال على ذلك، استعمال عبارة 'جلد حقيقي' كعلامة تجارية لبضائع غير مصنوعة من الجلد.."
    if msg.get('entities').get('t_37:t_37') != None:
        if msg.get('entities').get('t_37:t_37')[0].get('name') == "t_37":
            return "يجب تسجيل العلامة في كل بلد على حدة"
    if msg.get('entities').get('t_36:t_36') != None:
        if msg.get('entities').get('t_36:t_36')[0].get('name') == "t_36":
            return "حماية العلامات التجارية تكون أساسًا من خلال القوانين الوطنية أو الإقليمية. يشترط في غالب الأحيان تسجيل العلامة قبل حصولها على الحماية ولكن في بعض الحالات تتم حماية العلامة بعد استخدامها لمدة طويلة."
    if msg.get('entities').get('t_40:t_40') != None:
        if msg.get('entities').get('t_40:t_40')[0].get('name') == "t_40":
            return "يمكن أن تستعمل هذه الإشارة كعلامة تجارية، ولذا فإن حمايتها بواسطة العلامات التجارية هي أكثر الطرق احتمالاً."
    if msg.get('entities').get('t_43:t_43') != None:
        if msg.get('entities').get('t_43:t_43')[0].get('name') == "t_43":
            return "من أهم وظائف العلامة التجارية:" + "\n" + "1/ مساعدة المستهلك ﻓﻲ تحديد وتمييز السلع والخدمات" + "\n" + "2/ تسمح لشركات بتمييز منتجاتها" + "\n" + "3/ تعتبر أداة تسويق الأساس لتكوين صورة وسمعة للشركة في السوق" + "\n" + "4/ يمكن ترخيصها للحصول ﻋﻠﻰ دخل مباشر من خلال الإتاوات" + "\n" + "5/ ﻋﻨﺼر أساسي من عناصر الأصول التجارية لشركة " + "\n" + " 6/تشجع الشركات ﻋﻠﻰ الاستثمار ﻓﻲ الجودة" + "\n" + " 7/ يمكن أن تكون مفيدة للحصول على تمويل ."
    if msg.get('entities').get('t_33:t_33') != None:
        if msg.get('entities').get('t_33:t_33')[0].get('name') == "t_33":
            return "هو عنوان موقع الكتروني معد لتيسير تحديدة وحفظه على الأنترنت.فمثلاً wipo.int يستعمل لتحديد موقع الويبو على الشبكة www.wipo.int وتتألف أسماء الحقول في بعض الأحيان من علامات تجارية.ويحصل أن يبادر أحياناً أشخاص غير صاحب العلامة إلى تسجيل هذة العلامة كأسم حقل بسوء نية .ويطلق ﻋﻠﻰ ﻫذا التصرف اسم السطو الألكتروني."
    if msg.get('entities').get('t_38:t_38') != None:
        if msg.get('entities').get('t_38:t_38')[0].get('name') == "t_38":
            return "يرتكز مفھوم حماية العلامات التجارية، سواءً كانت مسجلة أم لا على الأساسين التاليين:الأول وھو أن العلامة التجارية توفر لرجال الأعمال وسيلة فعالة لمنع أعمال المنافسة التي تتم من خلال خلق الالتباس في ذھن المستھلكين إذ تجعلھم يعتقدون أنھم يشترون سلعاً وخدمات معروفة في حين انهم يشترون سلعاً وخدمات مقلدة وأقل جودة. وتقود أعمال التقليد هذه إلى زعزعة ثقة المستهلك بمنتجات صاحب العلامة وتلحقق ضرراً كبيراً بسمعته في السوق."

    if msg.get('entities').get('t107:t107') != None:
        if msg.get('entities').get('t107:t107')[0].get('name') == "t107":
            return "يجب توفير متطلبات الجهات ذات العلاقة."
    if msg.get('entities').get('t163:t163') != None:
        if msg.get('entities').get('t163:t163')[0].get('name') == "t163":
            return "لايمكن تعديل الفئه بعد اختيارها ويمكنكم طلب تسجيل جديد على الفئه المناسبه لكم ."
    if msg.get('entities').get('t66:t66') != None:
        if msg.get('entities').get('t66:t66')[0].get('name') == "t66":
            return " نطاق الحماية يكون في السعودية فقط و يمكنكم الإطلاع على النظام و اللائحة التنفيذية للعلامات التجارية على الرابط التالي: https://t.co/SjhmMrhCwI"
    if msg.get('entities').get('t108:t108') != None:
        if msg.get('entities').get('t108:t108')[0].get('name') == "t108":
            return "  من خلال الدخول على الطلب ثم خيارات ، طلب شهادة الايداع"
    if msg.get('entities').get('t70:t70') != None:
        if msg.get('entities').get('t70:t70')[0].get('name') == "t70":
            return "حياك الله يمكنكم الاطلاع الانظمة و اللوائح على الرابط التالي : https://t.co/SjhmMrhCwI  ..."
    if msg.get('entities').get('t110:t110') != None:
        if msg.get('entities').get('t110:t110')[0].get('name') == "t110":
            return " استعمال العلامة التجارية يكون بعد الحصول على الشهادة، ويمكنكم الإطلاع على المدة النظامية من خلال النظام و اللائحة التنفيذية للعلامات التجارية على الرابط التالي: https://t.co/xNRlaTz2fH…  "
    if msg.get('entities').get('t75:t75') != None:
        if msg.get('entities').get('t75:t75')[0].get('name') == "t75":
            return "نفيدكم بأن القوانين في العلامات التجارية هي المعمول بها النظام الخليجي ولائحته التنفيذية."
    if msg.get('entities').get('t111:t111') != None:
        if msg.get('entities').get('t111:t111')[0].get('name') == "t111":
            return "لمعرفة نظام العلامات التجارية يمكنك زيارة صفحة الأنظمة واللوائح من خلال الرابط التالي https://t.co/5FVQNBc5zC"
    if msg.get('entities').get('t114:t114') != None:
        if msg.get('entities').get('t114:t114')[0].get('name') == "t114":
            return "نرجو التواصل معنا عبر بوابة مركز التواصل على الرابط التالي :  https://t.co/bp3skdE9bZ  أو عبر البريد الإلكتروني التالي: saip@saip.gov.sa"
    if msg.get('entities').get('t115:t115') != None:
        if msg.get('entities').get('t115:t115')[0].get('name') == "t115":
            return "كل طلب جديد يدرس و يتم الرد علية عبر الموقع الرسمي للهيئة"
    if msg.get('entities').get('t189:t189') != None:
        if msg.get('entities').get('t189:t189')[0].get('name') == "t189":
            return "هلاً بك نرجوا رفع طلبكم عبر بوابة مركز التواصل على الرابط التالي : https://t.co/bp3skdE9bZ"
    if msg.get('entities').get('t187:t187') != None:
        if msg.get('entities').get('t187:t187')[0].get('name') == "t187":
            return "يتم تقديم طلب نقل ملكية من الاسم الشخصي إلى السجل التجاري للمؤسسة"
    if msg.get('entities').get('t95:t95') != None:
        if msg.get('entities').get('t95:t95')[0].get('name') == "t95":
            return "أهلا بك لتجديد العلامة يمكنكم التواصل معنا على مركز التواصل عبر الرابط التالي : https://t.co/cqiDPLNn0Y "
    if msg.get('entities').get('t126:t126') != None:
        if msg.get('entities').get('t126:t126')[0].get('name') == "t126":
            return "يجب أخذ الموافقة من مالك العلامة التجارية، و يمكنكم الاطلاع على النظام و اللائحة التنفيذية على الرابط التالي: https://t.co/SjhmMrhCwI"
    if msg.get('entities').get('t119:t119') != None:
        if msg.get('entities').get('t119:t119')[0].get('name') == "t119":
            return "اتفاقية نيس تعني بتوحيد تسجيل الفئات في الدول المنظمة للاتفاقية"
    if msg.get('entities').get('t98:t98') != None:
        if msg.get('entities').get('t98:t98')[0].get('name') == "t98":
            return "  يجب تسجيل كل علامة على حدة بسبب أن كل قطاع و نشاط للشركة مختلف و له فئة تسجيل خاصة به ، و يمكنكم الاطلاع على النظام و اللائحة التنفيذية للعلامات التجارية عبر الرابط التالي : https://t.co/6z0nBgA7hv  "
    if msg.get('entities').get('t150:t150') != None:
        if msg.get('entities').get('t150:t150')[0].get('name') == "t150":
            return "لا يجوز تسجيل العلامة اللتي تحمل أسماء أو بيانات جغرافية"
    if msg.get('entities').get('t120:t120') != None:
        if msg.get('entities').get('t120:t120')[0].get('name') == "t120":
            return "لا يمكن تسجيل العلامة التجارية اذا تم تقليد الشكل الهندسي أو الاسم أو الصورة"
    if msg.get('entities').get('t88:t88') != None:
        if msg.get('entities').get('t88:t88')[0].get('name') == "t88":
            return "يمكنكم تقديم دعوى شطب علامة تجارية لدى المحكمة الإدارية"
    if msg.get('entities').get('t121:t121') != None:
        if msg.get('entities').get('t121:t121')[0].get('name') == "t121":
            return "نعم يحمى كعلامة تجارية"
    if msg.get('entities').get('t122:t122') != None:
        if msg.get('entities').get('t122:t122')[0].get('name') == "t122":
            return "بعد انتهاء فترة النشر وعدم تقديم اعتراض على علامتكم المنشورة"
    if msg.get('entities').get('t91:t91') != None:
        if msg.get('entities').get('t91:t91')[0].get('name') == "t91":
            return "النظام المطبق حالياً هو  نظام العلامات التجارية لدول مجلس التعاون لدول الخليج العربية، الموافق عليه بالمرسوم الملكي رقم (م/51) وتاريخ 26/07/1435هـ."
    if msg.get('entities').get('t90:t90') != None:
        if msg.get('entities').get('t90:t90')[0].get('name') == "t90":
            return "نعم يمكنكم الجمع بين العلامة التجارية و حق المؤلف بعد الاطلاع على النظام و اللائحة التنفيذة لهما ."
    if msg.get('entities').get('t85:t85') != None:
        if msg.get('entities').get('t85:t85')[0].get('name') == "t85":
            return "الاسماء التجارية لدى الوزارة نأمل التواصل مع وزارة التجارة للاستفسار عبر: 92000667"
    if msg.get('entities').get('t82:t82') != None:
        if msg.get('entities').get('t82:t82')[0].get('name') == "t82":
            return " يمكنكم التقديم على فئة جديدة حسب الاجراءات المتبعة ، و يمكنكم الاطلاع على النظام و اللائحة التنفيذية لنظام العلامات التجارية على الرابط التالي : https://t.co/6z0nBgA7hv  "

    if msg.get('entities').get('t84:t84') != None:
        if msg.get('entities').get('t84:t84')[0].get('name') == "t84":
            return " يمكنكم التقديم لجنة النظر في تظلمات العلامات التجارية عبر البريد الرسمي للجنة :   TLC@SAIP.GOV.SA"
    if msg.get('entities').get('t81:t81') != None:
        if msg.get('entities').get('t81:t81')[0].get('name') == "t81":
            return "تعني أن العلامة تشمل صورة و حروف."
    if msg.get('entities').get('t80:t80') != None:
        if msg.get('entities').get('t80:t80')[0].get('name') == "t80":
            return "الرسوم غير مستردة."
    if msg.get('entities').get('t133:t133') != None:
        if msg.get('entities').get('t133:t133')[0].get('name') == "t133":
            return "نعم وتبقى مسجلة ومحمية"
    if msg.get('entities').get('t134:t134') != None:
        if msg.get('entities').get('t134:t134')[0].get('name') == "t134":
            return "العلامة التجارية تبقى محمية وسارية دون الحاجة لأي إجراء وماتم هو نقل الاختصاص من وزارة التجارة والاستثمار إلى الهيئة."
    if msg.get('entities').get('t180:t180') != None:
        if msg.get('entities').get('t180:t180')[0].get('name') == "t180":
            return "يمكنكم تقديم طلب نقل الملكية عبر نظام العلامات التجارية"
    if msg.get('entities').get('t136:t136') != None:
        if msg.get('entities').get('t136:t136')[0].get('name') == "t136":
            return "نرجو التواصل معنا عبر بوابة مركز التواصل على الرابط التالي : https://t.co/bp3skdE9bZ أو عبر البريد الإلكتروني التالي: saip@saip.gov.sa  "
    if msg.get('entities').get('t102:t102') != None:
        if msg.get('entities').get('t102:t102')[0].get('name') == "t102":
            return "تصنيف الفئات مرتبط بالتصنيف الدولي للسلع و الخدمات تصنيف نيس."
    if msg.get('entities').get('t101:t101') != None:
        if msg.get('entities').get('t101:t101')[0].get('name') == "t101":
            return "تمت الموافقة على طلبكم بالحماية للعلامة بمجملها، تعني لا يمكن أستخدام أحد مكونات العلامة بشكل منفصل."
    if msg.get('entities').get('t_00:t_00') != None:
        if msg.get('entities').get('t_00:t_00')[0].get('name') == "t_00":
            return "أساسًا، العلامة التجارية هي إشارة تستعمل لتمييز سلع وخدمات مشروع ما عن غيرها من السلع والخدمات. هذا تعريف مبسط جدًا يشرح بشكل عام ما هي العلامة التجارية."
    if msg.get('entities').get('t_44:t_44') != None:
        if msg.get('entities').get('t_44:t_44')[0].get('name') == "t_44":
            return "من الممكن اللجوء إلى الحماية التي تمنحها قوانين المنافسة غير المشروعة، في هذه الحالة يجب أن تكون العلامة ذات سمعة معروفة"

    return 'آسفة لم افهم سؤالك، من فضلك يرجى إعادة صياغة السؤال بطريقة أخرى'


def process_copyright(msg): #copyright intent responses
    if msg.get('entities').get('c_10:c_10') != None:
        if msg.get('entities').get('c_10:c_10')[0].get('name') == "c_10":
            return "التطبيقات الالكترونية تحمى تلقائياً بالنشر وفي حال رغبتكم بالحصول على وثيقة حماية فيمكنم تقديم طلب لخدمة التسجيل الاختياري لمصنفات حق المؤلف عبر الرابط التالي: https://t.co/vlxXWAyAlj "
    if msg.get('entities').get('c_11:c_11') != None:
        if msg.get('entities').get('c_11:c_11')[0].get('name') == "c_11":
            return "القصائد تعد محمية بموجب نظام حماية حق المؤلف من تاريخ النشر وفي حال تم انتهاك المصنف و رغبتكم في تقديم شكوى للهيئة للحق العام كرماً تزويدنا بالإثباتات التالية: أصل المصنف ، إثبات التعدي، بيانات المعتدي، وتزويدنا بها عبر البريد: saip@saip.gov.sa"
    if msg.get('entities').get('c_12:c_12') != None:
        if msg.get('entities').get('c_12:c_12')[0].get('name') == "c_12":
            return "الكتب والروايات تعد محمية بموجب نظام حماية حق المؤلف من تاريخ النشر وفي حال تم انتهاك المصنف و رغبتكم في تقديم شكوى للهيئة للحق العام كرماً تزويدنا بالإثباتات التالية: أصل المصنف ، إثبات التعدي، بيانات المعتدي، وتزويدنا بها عبر البريد الرسمي: saip@saip.gov.sa"
    if msg.get('entities').get('c_13:c_13') != None:
        if msg.get('entities').get('c_13:c_13')[0].get('name') == "c_13":
            return "نفيدكم بأن المملكة ممثلة بالهيئة السعودية للملكية الفكرية قد انضمت مسبقاً لاتفاقية معاهدة مراكش والتي تسمح للمكفوفين استخدام الكتب وتحويلها إلى لغة برايل"

    if msg.get('entities').get('c_14:c_14') != None:
        if msg.get('entities').get('c_14:c_14')[0].get('name') == "c_14":
            return "حسب النظام و اللائحة التنفيذية لحق المؤلف لا يمكن حماية الأساليب التجارية و أساليب العمل، و يمكنكم الاطلاع على النظام و اللائحة التنفيذية على الرابط التالي: https://t.co/WXHRtXd9Mx"
    if msg.get('entities').get('c_15:c_15') != None:
        if msg.get('entities').get('c_15:c_15')[0].get('name') == "c_15":
            return "إبرام العقود قبل ممارسة أي نشاط متعلق بالملكية الفكرية، يحفظ لك حقوقك. و يمكنك الاطلاع على النظام و اللائحة التنفيذية لحق المؤلف على الرابط التالي: https://t.co/SjhmMrhCwI"

    if msg.get('entities').get('c_16:c_16') != None:
        if msg.get('entities').get('c_16:c_16')[0].get('name') == "c_16":
            return "المصنفات تعد محمية بموجب نظام حماية حق المؤلف من تاريخ النشر وفي حال تم انتهاك المصنف و رغبتكم في تقديم شكوى للهيئة للحق العام كرماً تزويدنا بالإثباتات التالية: أصل المصنف ، إثبات التعدي، بيانات المعتدي، وتزويدنا بها عبر البريد: https://t.co/m4YCoSj19H "

    if msg.get('entities').get('c_17:c_17') != None:
        if msg.get('entities').get('c_17: c_17')[0].get('name') == "c_17":
            return " لا يمكن استخدام المصنف إلا بعد أخذ موافقة خطية من صاحب المصنف، و يمكنكم الاطلاع على النظام و اللائحة التنفيذية لحق المؤلف على الرابط التالي: https://t.co/xNRlaTz2fH…"

    if msg.get('entities').get('c_18:c_18') != None:
        if msg.get('entities').get('c_18: c_18')[0].get('name') == "c_18":
            return " التصاميم تعد محمية بموجب نظام حق المؤلف وفي حال الانتهاك ورغبتكم بتقديم شكوى للهيئة تزويدنا بالإثباتات التالية: أصل المصنف ، إثبات التعدي، بيانات المعتدي، وتزويدنا بها عبر البريد الرسمي للهيئة saip@saip.gov.sa"

    if msg.get('entities').get('c_19:c_19') != None:
        if msg.get('entities').get('c_19: c_19')[0].get('name') == "c_19":
            return " جميع مصنفات حق المؤلف محمية من تاريخ النشر بموجب نظام حق المؤلف ويمكنكم الاطلاع على النظام و اللائحة التنفيذية على الرابط التالي: https://t.co/SjhmMrhCwI حالياً متاح التسجيل الاختياري للتصاميم المعمارية و مصنفات الحاسب الآلي."

    if msg.get('entities').get('c_20:c_20') != None:
        if msg.get('entities').get('c_20: c_20')[0].get('name') == "c_20":
            return " محتوى الدورات التدريبية والمواد العلمية من تاريخ النشر تبدأ الحماية الفكرية له بدون تسجيل و يمكنكم الاطلاع على النظام و اللائحة التنفيذية لحق المؤلف على الرابط التالي : https://t.co/SjhmMrhCwI"

    if msg.get('entities').get('c_21:c_21') != None:
        if msg.get('entities').get('c_21: c_21')[0].get('name') == "c_21":
            return "الأعمال الفنية والحرفية تعد محمية بموجب نظام حماية حق المؤلف من تاريخ النشر وفي حال تم انتهاك المصنف ورغبتكم في تقديم شكوى للهيئة كرماً تزويدنا بالإثباتات التالية: أصل المصنف ، إثبات التعدي، بيانات المعتدي، وتزويدنا بها عبر البريد الرسمي: saip@saip.gov.sa"

    if msg.get('entities').get('c_22:c_22') != None:
        if msg.get('entities').get('c_22: c_22')[0].get('name') == "c_22":
            return " الأعمال القائمة على مصنفات إبداعية تعد من المصنفات المشتقة التي يحميها نظام حق المؤلف والتي لابد من حصول على إذن كتابي من صاحب الحق للعمل الأصلي قبل استخدامها. و يمكنكم الاطلاع على النظام و اللائحة التنفيذية على الرابط التالي: https://t.co/SjhmMrhCwI"

    if msg.get('entities').get('c_23:c_23') != None:
        if msg.get('entities').get('c_23: c_23')[0].get('name') == "c_23":
            return "في الصورة الخام يوجد إعدادات تاريخ التصوير ، يتم الاعتماد عليها في حفظ الملكية الفكرية للصورة."
    if msg.get('entities').get('c01:c01') != None:
        if msg.get('entities').get('c01:c01')[0].get('name') == "c01":
            return "التثبيت يعني كتابة العمل أو تسجيله. ولا يتحتم عليك كمؤلف أن تقوم بالتسجيل بنفسك: فإذا قمت أنت مثلاً بتأليف لحن ما وصرت تدندن به بطريقة عفوية في الشارع وقام شخص آخر بتسجيله يصبح هذا العمل مثبتً وبالتالي فإنه يتمتع بالحماية. فإذا قام شخص ثالث باستخدام هذا التسجيل وقام بإعداد نسخ منه مثلاً، فيكون قد تعرض لحقوق المؤلف الخاصة بك."
    if msg.get('entities').get('c02:c02') != None:
        if msg.get('entities').get('c02:c02')[0].get('name') == "c02":
            return "في الدول الموقعة على اتفاقية برن، يتمتع أصحاب حق المؤلف أو الأجانب الذين ينتمون إلى دولة عضو في الاتفاقية بالحماية بموجب هذه الاتفاقية وذلك دون اللجوء إلى أي إجراءات شكلية أو إلى أي تسجيل. ولكن يحق للبلدان أن تفرض بعض الإجرءات على مواطنيها لأن الاتفاقيات الدولية لا ترعى إلا معاملة الأجانب وهذا ما تفعله مثلاً الولايات المتحدة الأمريكية، حيث يشترط تسجيل المصنف في مكتب حق المؤلف التابع لمكتبة الكونغرس، والمطالبة بحق المؤلف من خلال الحصول على إشعار بالحقوق المحفوظة، مع علامة وتاريخ سنة النشر لأول مرة. وهذا ما نراه على معظم الكتب المنشورة. هذا مهم خاصة بالنسبة للمواطنين الأمريكيين الذين يتوجب عليهم أن يتقيدوا بكل هذه الإجراءات."
    if msg.get('entities').get('c03:c03') != None:
        if msg.get('entities').get('c03:c03')[0].get('name') == "c03":
            return "في الدول الموقعة على اتفاقية برن ليس هناك ما يجب فعله إذ إن اتفاقية برن تقوم على مبدأ غياب الشكليات فالابتكار يساوي الحماية."
    if msg.get('entities').get('c04:c04') != None:
        if msg.get('entities').get('c04:c04')[0].get('name') == "c04":
            return "من حيث المبدأ إن القوانين الوطنية هي التي تحدد مدة الحماية، ولكن اتفاقية برن تنص على أن الحد الأدنى للحماية هو 50 عامًا. وتسري مدة الحماية بدءًا من نهاية سنة وفاة المؤلف. ولطريقة الحساب هذه فوائد عملية، إذ إنه ليس من الضروري معرفة التاريخ الدقيق لوفاة المؤلف ولكن ينبغي معرفة سنة الوفاة فقط. ولكن وفي السنوات الأخيرة، بدأ يظهر اتجاه لإطالة مدة الحماية. ففي دول الاتحاد الأوربي ودول المنطقة الاقتصادية الأوروبية أصبحت مدة الحماية 70 عامًا منذ نهاية سنة وفاة المؤلف، وهذه المدة نفسها يتضمنها قانون حق المؤلف الأميركي مما يؤكد أن ثمة اتجاها لإطالة مدة الحماية من 50 عامًا إلى 70 عامًا. أما بالنسبة لمصنفات التصوير الفوتوغرافي ولمصنفات الفن التطبيقي فتنص اتفاقية برن على مدة حماية أقل من خمسين سنة وتشترط على ألا تقل هذه المدة عن خمس وعشرين سنة من تاريخ إنجاز المصنف."
    if msg.get('entities').get('c05:c05') != None:
        if msg.get('entities').get('c05:c05')[0].get('name') == "c05":
            return "إن الحد الأدنى للحماية بموجب اتفاقية برن هو 50 عامًا من تاريخ نهاية سنة وفاة المؤلف. وقد تم تمديد هذه المدة في بعض البلدان كبلدان الاتحاد الأوروبي والولايات المتحدة الأمريكية لتصبح 70 عامًا من نهاية سنة وفاة المؤلف. وتنص اتفاقية برن على مدة أقصر للحماية في ما يتعلق بمصنفات التصوير الفوتوغرافي ومصنفات الفن التطبيقي بحيث تبلغ مدة حماية هذه المصنفات 25 سنة."
    if msg.get('entities').get('c06:c06') != None:
        if msg.get('entities').get('c06:c06')[0].get('name') == "c06":
            return "إن أقدم هذه الاتفاقيات وأهمها هي اتفاقية برن لحماية المصنفات الأدبية والفنية. ويعود تاريخ إبارمها إلى العام 1886. وقد تمت مراجعتها عدة مرات بمعدل مرة كل عشرين سنة تقريبًا. أما آخر تعديل لهذه الاتفاقية فهو وثيقة باريس للعام 1971. تتناول اتفاقية برن حماية حق المؤلف، وهي ترتكز على قواعد عامة مثل مبدأ المعاملة الوطنية الذي يقضي بأنه، وبموجب القوانين الوطنية، يجب أن تتمتع المصنفات المنشورة في إحدى دول الاتحاد بالحماية نفسها التي تتمتع بها المصنفات الوطنية. كما تحدد هذه الاتفاقية الحد الأدنى المطلوب من الحماية الذي يجب أن تلتزم به القوانين الوطنية التي يمكنها بالطبع أن تتجاوز هذا الحد وتؤمن حماية أكثر. أما بالنسبة إلى اتفاق تريبس، الذي ظهر نتيجة جولة أوروغواي، فتديره منظمة التجارة العالمية، وهو يتضمن بشكل صريح القواعد التي تقوم عليها اتفاقية برن باستثناء ما يتعلق بالحقوق المعنوية لأن لا صلة لهذه الحقوق بالتجارة."
    if msg.get('entities').get('c07:c07') != None:
        if msg.get('entities').get('c07:c07')[0].get('name') == "c07":
            return "تعتبر معاهدة الويبو بشأن حق المؤلف تحديثاً لاتفاقية برن واستجابة للتطو ارت المحققة في مجال التكنولوجيا وفي الأسواق، وتعالج هذه المعاهدة مسائل حق المؤلف في محيط التكنولوجيا الرقمية. وتشمل الحماية الممنوحة بموجب هذه المعاهدة أوجه التعبير وليس الأفكار أو الإجارءات أو أساليب العمل أو مفاهيم الرياضيات. ويتمتع المؤلفون بموجب هذه المعاهدة بحقوق التوزيع والتأجير ونقل المصنف إلى الجمهور."
    if msg.get('entities').get('c08:c08') != None:
        if msg.get('entities').get('c08:c08')[0].get('name') == "c08":
            return "في الواقع إن فوائد حق المؤلف الثقافية والاقتصادية لكثيرة. فحق المؤلف يرتبط ارتباطًا وثيقا بالثقافة، ومن المؤكد أنه في حال لم توجد حماية بموجب حق المؤلف فإن المجتمع الفني سيكون عرضة للاحتيال ولن يتمكن الفنانون من الاستفادة من جهودهم. قد تستثمر مبالغ ضخمة من المال لإنتاج برنامج حاسوب أو فيلم سينمائي أو برنامج تلفزيوني ما. ولكنه إذا كان بمستطاع أي كان عند صدور أول نسخة من هذا البرنامج أن ينسخه وأن يسوقه دون أي رادع فعندها تنعدم إمكانية تسويق هذا البرنامج والانتفاع منه مما يؤثر سلباً على النشاطات الابتكارية ويضر كثياًرً بالحياة الثقافية الوطنية."
    if msg.get('entities').get('c09:c09') != None:
        if msg.get('entities').get('c09:c09')[0].get('name') == "c09":
            return "تختلف الحقوق المجاورة عن حق المؤلف وٕإن كانت تنطوي على حقوق مشابهة له لأنها مشتقة أصلاً من مصنف محمي بموجب حق المؤلف. وهذا ما يفسر الاتصال الوثيق بينهما. ولا تتناول الحقوق المجاورة المصنفات ذاتها بل تتناول الوسطاء في عملية نقل هذه المصنفات إلى الجمهور وهي تمنح هؤلاء الحقوق الاستئثارية ذاتها التي يمنحها حق المؤلف."

    if msg.get('entities').get('c30:c30') != None:
        if msg.get('entities').get('c30:c30')[0].get('name') == "c30":
            return "فنانو الأداء (المغنون مثلاً). منتجو التسجيلات الصوتية. (شركات إنتاج الأشرطة). هيئات البث."
    if msg.get('entities').get('c31:c31') != None:
        if msg.get('entities').get('c31:c31')[0].get('name') == "c31":
            return "تتمتع حقوق البث بأهمية خاصة عندما يتعلق الأمر بالبرامج الرياضية. ففي عدد كبير من الدول، لا تتمتع هذه البرامج بالحماية بموجب حق المؤلف. ولكن ثمة بعض الدول وفي مقدمها الولايات المتحدة الأمريكية، والتي تعتبر أن المباراة الرياضية المصورة هي مصنف سمعي-بصري يتمتع بعنصر الابتكار الكافي المطلوب للحماية بموجب حق المؤلف. غير أن بلدانًا أخرى تعتبر أن عنصر اللعب هو العنصر الحاسم الأهم، وبالتالي ترى هذه الدول أن المباراة الرياضية المصورة تفتقر لعنصر الابتكار إذ يكتفي فيها المصور، مهما كانت قدرته عالية في مجال التصوير، بتصوير اللاعبين أثناء اللعب . وبالتالي فإن هذه الدول لا تعتبر عمل المصور هذا مصنفا فنيًا. وعليه، نرى أن المباريات الرياضية التي يمكن حمايتها بموجب حق المؤلف لا توجد أو هي قليلة جدًا."
    if msg.get('entities').get('c32:c32') != None:
        if msg.get('entities').get('c32:c32')[0].get('name') == "c32":
            return "إن مدة حماية الحقوق المجاورة بموجب اتفاقية روما هي 20 عامًا ابتداءً من (المادة 14 من اتفاقية روما): - نهاية سنة تثبيت التسجيل الصوتي أو الأداء المدرج فيه. - نهاية سنة الأداء غير المدرج في تسجيلات صوتية. -نهاية سنة بث البرنامج. وتجدر الإشارة إلى أن معظم التشريعات الوطنية تنص على مدة من الحماية أطول من الحد الأدنى الذي حددته اتفاقية روما."
    if msg.get('entities').get('cc1:cc1') != None:
        if msg.get('entities').get('cc1:cc1')[0].get('name') == "cc1":
            return "الملكية الفكرية تبقى للمصمم حتى بعد بيع التصاميم المعمارية، و لمالك التصاميم حق بيعها في أي وقت بدون حذف اسم المصمم و يمكنكم الاطلاع على النظام و اللائحة التنفيذية لحق المؤلف على الرابط التالي: https://t.co/SjhmMr0188"
    if msg.get('entities').get('cc2:cc2') != None:
        if msg.get('entities').get('cc2:cc2')[0].get('name') == "cc2":
            return "جميع المنصات الإلكترونية يمكن تسجيلها في نظام حق المؤلف بعد تشغيلها في النسخة النهائية على الرابط التالي: https://t.co/vlxXWAyAlj"
    if msg.get('entities').get('cc3:cc3') != None:
        if msg.get('entities').get('cc3:cc3')[0].get('name') == "cc3":
            return "يمكنكم اثبات حقوق الملكية الفكرية من خلال النشر أو أي وسيلة نص عليها نظام حق المؤلف و اللائحة التنفيذية له و يمكنكم الاطلاع عليها عبر الرابط التالي :https://t.co/SjhmMrhCwI"
    if msg.get('entities').get('cc4:cc4') != None:
        if msg.get('entities').get('cc4:cc4')[0].get('name') == "cc4":
            return "في اي وقت يمكنكم رفع دعوى إنتهاك مصنفات حق المؤلف، و يمكنكم الاطلاع على النظام و اللائحة التنفيذية لحق المؤلف على الرابط التالي : https://t.co/SjhmMrhCwI"
    if msg.get('entities').get('cc5:cc5') != None:
        if msg.get('entities').get('cc5:cc5')[0].get('name') == "cc5":
            return "نعم إذا كان دون الإشارة لصاحب الاقتباس."
    if msg.get('entities').get('cc6:cc6') != None:
        if msg.get('entities').get('cc6:cc6')[0].get('name') == "cc6":
            return " يمكنكم الإطلاع على الرسوم عبر اللائحة التنفيذية للتسجيل الاختياري لمصنفات حق المؤلف على الرابط التالي :https://t.co/sQ1P3yb0wY"
    if msg.get('entities').get('cc7:cc7') != None:
        if msg.get('entities').get('cc7:cc7')[0].get('name') == "cc7":
            return "الرسومات تعد محمية بموجب نظام حماية حق المؤلف وفي حال تم انتهاك المصنف ورغبتكم في تقديم شكوى للهيئة كرماً تزويدنا بالإثباتات التالية: أصل المصنف ، إثبات التعدي، بيانات المعتدي، وتزويدنا بها عبر البريد الرسمي للهيئة saip@saip.gov.sa"
    if msg.get('entities').get('cc8:cc8') != None:
        if msg.get('entities').get('cc8:cc8')[0].get('name') == "cc8":
            return "من شروط النظام و اللائحة التنفيذية لحق المؤلف لتسجيل المصنفات الاختيارية أن يكون المصنف في شكله النهائي وليس مسودة أو عمل تحضيري لإعداده، المادة ٦ الفقرة ٥ ،و يمكنكم الاطلاع عليها عبر الرابط التالي : https://t.co/sQ1P3yb0wY"
    if msg.get('entities').get('cc9:cc9') != None:
        if msg.get('entities').get('cc9:cc9')[0].get('name') == "cc9":
            return "خلال ٣ دقائق يمكنك تقديم طلب تسجيل مصنف حق مؤلف للمجالات المشمولة حالياً: البرمجيات وتطبيقات الحاسب الآلي أو التصاميم المعمارية.. عبر البوابة الإلكترونية للهيئة https://t.co/NOiaOkbpIa"
    if msg.get('entities').get('cc10:cc10') != None:
        if msg.get('entities').get('cc10:cc10')[0].get('name') == "cc10":
            return "التحوير على المصنف من تعديل أو تلخيص أو شرح يعتبر من حقوق المؤلف .. فلا بد من إذن المؤلف."
    if msg.get('entities').get('cc11:cc11') != None:
        if msg.get('entities').get('cc11:cc11')[0].get('name') == "cc11":
            return "السيناريو يعد محمي بموجب نظام حماية حق المؤلف من تاريخ النشر ، ولا يوجد له تسجيل و يمكنكم الاطلاع على النظام و اللائحة التنفيذية على الرابط التالي :https://t.co/xNRlaTz2fH…"
    if msg.get('entities').get('cc12:cc12') != None:
        if msg.get('entities').get('cc12:cc12')[0].get('name') == "cc12":
            return "المصنف الفني ( الموسيقى ) محمي من تاريخ النشر بموجب النظام ولا حاجة للتسجيل للتمتع بحماية ، ولتقديم شكوى يلزم احضار جميع مايثبت امتلاك المصنف الاصل ومايثبت الانتهاك"
    if msg.get('entities').get('cc13:cc13') != None:
        if msg.get('entities').get('cc13:cc13')[0].get('name') == "cc13":
            return "يقصد بالمصنفات تلك المذكورة في نظام حماية حقوق المؤلف، كـ المصنفات الأدبية والفنية وغيرها وليس المقصود عملية تصنيف أو ماشابه."
    if msg.get('entities').get('cc14:cc14') != None:
        if msg.get('entities').get('cc14:cc14')[0].get('name') == "cc14":
            return "الخطوط محمية بنظام حق المؤلف ولا تحتاج إلى تسجيل"
    if msg.get('entities').get('cc15:cc15') != None:
        if msg.get('entities').get('cc15:cc15')[0].get('name') == "cc15":
            return "الأفكار و الأساليب التعليمية مستثناة من الحماية، كما يمكنكم الإطلاع على نظام حق المؤلف و اللائحة التنفيذية له عبر الرابط التالي: https://t.co/SjhmMrhCwI"
    if msg.get('entities').get('cc16:cc16') != None:
        if msg.get('entities').get('cc16:cc16')[0].get('name') == "cc16":
            return "النصوص تعد محمية بموجب نظام حماية حق المؤلف من تاريخ النشر وفي حال تم انتهاك المصنف و رغبتكم في تقديم شكوى للهيئة للحق العام كرماً تزويدنا بالإثباتات التالية: أصل المصنف ، إثبات التعدي، بيانات المعتدي، وتزويدنا بها عبر البريد:saip@saip.gov.sa"
    if msg.get('entities').get('cc17:cc17') != None:
        if msg.get('entities').get('cc17:cc17')[0].get('name') == "cc17":
            return "المعادلات الرياضية مستثناة من الحماية، و يمكنكم الإطلاع على نظام حق المؤلف و اللائحة التنفيذية على الرابط التالي:https://t.co/SjhmMrhCwI"
    if msg.get('entities').get('cc18:cc18') != None:
        if msg.get('entities').get('cc18:cc18')[0].get('name') == "cc18":
            return "المؤلف هو من قام بأبتكار المصنف."

    if msg.get('entities').get('c1:c1') != None:
        if msg.get('entities').get('c1:c1')[0].get('name') == "c1":
            return "يهدف حق المؤلف إلى حماية المؤلفين (الكتاب، الفنانون، الملحنون) في ابتكاراتهم. ويطلق على هذه الابتكارات عادة اسم المصنفات"
    if msg.get('entities').get('c2:c2') != None:
        if msg.get('entities').get('c2:c2')[0].get('name') == "c2":
            return "تشمل المصنفات المحمية بحق المؤلف ما يلي ذكره على سبيل المثال لا الحصر: الروايات وقصائد الشعر والمسرحيات والمراجع والصحف وقواعد البيانات والأفلام والمؤلفات الموسيقية وتصاميم الرقصات والألواح الزيتية والرسوم والصور الشمسية والمنحوتات ومصنفات الهندسة المعمارية والإعلانات والخرائط والرسوم التقنية. كما تشمل الحماية بحق المؤلف برامج الحاسوب أيضًا."
    if msg.get('entities').get('c3:c3') != None:
        if msg.get('entities').get('c3:c3')[0].get('name') == "c3":
            return "١- المصنفات الأدبية والفنية والعلمية ٢- منجزات الفنانين القائمين بالأداء والفونوغرامات وبرامج الإذاعة والتلفزيون ٣- الاختراعات في جميع مجالات الاجتهاد الإنساني ٤- الاكتشافات العلمية ٥- الرسوم والنماذج الصناعية ٦- العلامات التجارية وعلامات الخدمة والأسماء والسمات التجارية ٧- الحماية من المنافسة غير المشروعة ٨- وجميــع الحقـوق الأخــرى الناتجـة عــن النشــاط الفكــري فــي المجــالات الصــناعية والعلمية والأدبية والفنية"
    if msg.get('entities').get('c4:c4') != None:
        if msg.get('entities').get('c4:c4')[0].get('name') == "c4":
            return "حقوق مالية تتيح لصاحبها الأنتفاع المالي بالمصنف وهناك حقوق معنوية التي تبين العلاقة الشخصية بين المؤلف والمصنف"
    if msg.get('entities').get('c5:c5') != None:
        if msg.get('entities').get('c5:c5')[0].get('name') == "c5":
            return "تتيح الحقوق المالية لأصحابها الانتفاع بالمصنف أو التصريح للغير بالانتفاع به بناء على شروط متفق عليها"
    if msg.get('entities').get('c6:c6') != None:
        if msg.get('entities').get('c6:c6')[0].get('name') == "c6":
            return "يمكنهم منع أو التصريح بـ: - استنساخ المصنف بكل الأشكال، ومنها الطباعة والتسجيل الصوتي والتسـجيل علـى أقـراص الفيـديو أو الأقراص المدمجة، أو التخزين في ذاكرة الحاسوب. - توزيع المصنف من خلال بيع نسخ منه للعامة. - أداء المصنف علناً خلال حفلة موسيقية أو مسرحية مثلا. - إذاعة المصنف ونقله إلى الجمهور من خلال الراديو أو التلفزيون أو الكبل أو الساتل. - ترجمة المصنف إلى لغات أخرى. - تحوير المصنف كتحويل رواية إلى سيناريو."
    if msg.get('entities').get('c7:c7') != None:
        if msg.get('entities').get('c7:c7')[0].get('name') == "c7":
            return "تشمل الحقوق المعنوية الحق في أبوة المصنف بأن يذكر اسم المؤلف على المصنف وكذلك الحق في احترام المصنف بأن يمنح المؤلف الحق بالاعتراض على كل استعمال أو تعديل للمصنف يسيء إلى سمعة المؤلف أو شرفه."
    if msg.get('entities').get('c8:c8') != None:
        if msg.get('entities').get('c8:c8')[0].get('name') == "c8":
            return "ينقل المبدعون والمؤلفين حقوقهم إلى شركات بواسطة عقود ومقابل مكافآت ، وتتخذ هذه المكافآت أشكالاً متعددة تتراوح بين مبلغ مقطوع من المال ، أو إتاوات بطريقة نسبية بالاستناد إلى الارباح التي يحققها المصنف"
    if msg.get('entities').get('c9:c9') != None:
        if msg.get('entities').get('c9:c9')[0].get('name') == "c9":
            return "تبدأ المدة بمجرد إيداع المنصف وتثبيته"
    if msg.get('entities').get('c10:c10') != None:
        if msg.get('entities').get('c10:c10')[0].get('name') == "c10":
            return "مده ﻻ تقل ﻋـن خمسين سنة بعد وﻓـﺎة المبدع وﻗد تنص القوانين الوطنية ﻋﻠﻰ مدة أطول للحماية."
    if msg.get('entities').get('c11:c11') != None:
        if msg.get('entities').get('c11:c11')[0].get('name') == "c11":
            return "ﺘﻨص اﻻﺘﻔﺎﻗﻴﺎت الدولية والتشريعات الوطنية ﻋﻠـﻰ ﺤرﻴـﺔ اﺴـﺘﻌﻤﺎل ﻤﻘﺘطﻔـﺎت ﻤـن المصنفات ﺒﺸــــﻜل ﻤﻘﺘطﻔــــﺎت ﺼـــــﺤﻔﻴﺔ أو للتوضيح في ﻷﻏــــراض التعليمية.وذلك وفقاً لقواعد حسن الأستعمال وﺘﺨﺘﻠف ﻗواﻋد ﺤرﻴﺔ اﻻﺴـﺘﻌﻤﺎل ﻫـذﻩ ﻤـن ﺒﻠـد ﻵﺨـر لذا ﻨﻨﺼـﺤك بالعودة إلى ﻗﺎﻨوﻨـك الوطني لمعرفة ﻜﻴـف ﻴﻤﻜن أن ﺘﺴﺘﻔﻴد ﻤن ﻫذﻩ الحرية ﻓﻲ ﺒﻠدك."
    if msg.get('entities').get('c12:c12') != None:
        if msg.get('entities').get('c12:c12')[0].get('name') == "c12":
            return "تسهم حماية حق المؤلف المؤلف والحقوق المجاورة بشكل أساسي ﻓــﻲ النهوض بالنشاط اﻹﺒــداﻋﻲ والابتكاري."
    if msg.get('entities').get('c13:c13') != None:
        if msg.get('entities').get('c13:c13')[0].get('name') == "c13":
            return "تختلف الحقوق المجاورة عن حق المؤلف وٕإن كانت تنطوي على حقوق مشابهة له لأنها مشتقة أصلاً من مصنف محمي بموجب حق المؤلف. وهذا ما يفسر الاتصال الوثيق بينهما. ولا تتناول الحقوق المجاورة المصنفات ذاتها بل تتناول الوسطاء في عملية نقل هذه المصنفات إلى الجمهور وهي تمنح هؤلاء الحقوق الاستئثارية ذاتها التي يمنحها حق المؤلف."
    if msg.get('entities').get('c14:c14') != None:
        if msg.get('entities').get('c14:c14')[0].get('name') == "c14":
            return "حقوق فناني الأداء(مثل الممثلين والموسيقيين) في أدائهم وكذلك منتجي التسجيلات الصوتية (شرائط الكاسيت والأقراص المدمجة) في تسجيلاتهم وأيضاً هيئات الإذاعة في برامجها التلفزيونية. ويطلق على هذه الحقوق في بعض الأحيان اسم الحقوق المجاورة."
    if msg.get('entities').get('c15:c15') != None:
        if msg.get('entities').get('c15:c15')[0].get('name') == "c15":
            return "نعم هناك فرق تعود الحقوق المترتبة ﻋﻠﻰ حق المؤلف إلى المؤلفين. أما الحقوق المجاورة ﻓﺘﺨص ﻓﺌﺎت أخرى من أصحاب الحقوق."
    if msg.get('entities').get('c16:c16') != None:
        if msg.get('entities').get('c16:c16')[0].get('name') == "c16":
            return "تختلف الحقوق الممنوحة لفناني اﻷداء ومنتجي التسجيلات الصوتية وﻫﻴﺌﺎت اﻹذاﻋﺔ من بلد لآخر . وعلى المستوى الدولي تنبثق ﻫـذﻩ االحقوق ﻋـن الاتفاقية الدولية لحماية فناني اﻷداء ومنتجي التسجيلات وهيئات الأذاعة المعروفة باتفاقية روما لسنة 1961 وعن اتفاق تريبس وعن معاهدة الويبو بشأن الأداء والتسجيل الصوتي."
    if msg.get('entities').get('c17:c17') != None:
        if msg.get('entities').get('c17:c17')[0].get('name') == "c17":
            return "يتمتع فنانو اﻷداء بصورة عامة بالحق الاستئثاري بمنع تثبيت أدائهم ﻏﻴـر المثبت أو إذاﻋﺘـﻪ أو نقله إلى الجمهور. وتمنحهم بعض التشريعات الدولية كمعاهدة الويبو بشأن اﻷداء والتسجيل الصوتي حق استنتاخ وتوزيع وتأجير أوجه أدائهم المثبتة ﻓـــﻲ تسجيلات صوتية إضافة إلى الحق ﻓـــﻲ اﻻﻋﺘـــارض ﻋﻠـــﻰ كل تحريف أو تشوية أو تعديل أخر لأدائهم يكون ضاراً بسمعتهم."
    if msg.get('entities').get('c18:c18') != None:
        if msg.get('entities').get('c18:c18')[0].get('name') == "c18":
            return "ﻴﺘﻤﺘﻊ ﻤﻨﺘﺠو التسجيلات الصوتية بالحق اﻻﺴﺘﺌﺜﺎري ﻓﻲ التصريح ﺒﺎﺴﺘﻨﺴﺎخ أو ﺘوزﻴﻊ ﺘﺴﺠﻴﻼﺘﻬم الصوتية .أﻤﺎ ﻤﻌﺎﻫدة الويبو بشأن الأداء والتسجيل الصوتي فتحمي منتجي التسجيلات الصوتية وفناني الأداء عندما يتم توزيع مصنافاتهم بواسطة تكنولوجيا جديدة كاالأنترنت مثلاً."
    if msg.get('entities').get('c19:c19') != None:
        if msg.get('entities').get('c19:c19')[0].get('name') == "c19":
            return "ﻴﺤق لها أن ﺘﺠﻴز أو ﺘﺤظر إﻋﺎدة ﺒث ﺒراﻤﺠﻬﺎ وﺘﺜﺒﻴﺘﻬﺎ واﺴﺘﻨﺴﺎﺨﻬﺎ."
    if msg.get('entities').get('c20:c20') != None:
        if msg.get('entities').get('c20:c20')[0].get('name') == "c20":
            return "وتعرف الحقوق المجاورة اﺴــﺘﺜﻨﺎءات وتقيدات ﻴﻌرﻓﻬــﺎ ﺤــق المؤلف. ﻓﻴﺴــﻤﺢ بالنسبة للأعمال المؤداة والتسجيلات الصوتية وﺒرامج البث اﻹذاﻋﻲ ﺒﺎﻻﻨﺘﻔﺎع الخاص،وبالأنتفاع ﺒﻤﻘﺘطﻔﺎت ﻗﺼـﻴرة للتعليق ﻋﻠﻰ اﻷﺤداث الجارية، وﺒﺎﻻﻨﺘﻔﺎع المقصورﻋﻠﻰ أﻏراض التعليم أو البحث العلمي."
    if msg.get('entities').get('c21:c21') != None:
        if msg.get('entities').get('c21:c21')[0].get('name') == "c21":
            return "ﻴﺘﻤﺘـﻊ ﻓﻨــﺎﻨو اﻷداء ﺒﺎلحماية ﻷﻨﻬــم ﻴﺴــﺎﻫﻤون ﻓــﻲ ﻋﻤﻠﻴــﺔ اﻻﺒﺘﻜــﺎر الذهني."
    if msg.get('entities').get('c22:c22') != None:
        if msg.get('entities').get('c22:c22')[0].get('name') == "c22":
            return "لأنهم ﻴﺴﺎﻫﻤون ﻓﻲ ﻋﻤﻠﻴﺔ اﻻﺒﺘﻜﺎر وﻷن العمل ﻻ ﻴظﻬـر إلى الوجود إﻻ ﺒﻔﻀـل ﻤﻬـارﺘﻬم التقنية وﺘﻤـوﻴﻠﻬم للعمل."
    if msg.get('entities').get('c23:c23') != None:
        if msg.get('entities').get('c23:c23')[0].get('name') == "c23":
            return "لها ﻤﺼــﻠﺤﺔ ﻓــﻲ ﺤﻤﺎﻴـﺔ التقنية والتنظيمية ﻤـن أﻋﻤــﺎل القرصنة على برامجها."
    if msg.get('entities').get('c24:c24') != None:
        if msg.get('entities').get('c24:c24')[0].get('name') == "c24":
            return "الصور و المقاطع المرئية تعد محمية بموجب نظام حماية حق المؤلف من تاريخ النشر وفي حال تم انتهاك المصنف و رغبتكم في تقديم شكوى للهيئة للحق العام كرماً تزويدنا بالإثباتات التالية: أصل المصنف ، إثبات التعدي، بيانات المعتدي، وتزويدنا بها عبر البريد: saip@saip.gov.sa "

    return 'آسفة لم افهم سؤالك، من فضلك يرجى إعادة صياغة السؤال بطريقة أخرى'


def process_pv(msg): #plant varieties intent responses
    if msg.get('entities').get('v1:v1') != None:
        if msg.get('entities').get('v1:v1')[0].get('name') == "v1":
            return "يهدف نظام حماية الأصناف النباتية الجديدة إلى تشجيع تطوير أصناف جديدة من النباتات لصالح المجتمع. ويقتضي استولاد أصناف نباتية جديدة استثمارا هائلا من حيث المهارات واليد العاملة والموارد المادية والمال والوقت. ومنح مستولدي النباتات حقوقة استئثارية يعتبر حافزا لتطوير الزراعة والبستنة والحراجة."
    if msg.get('entities').get('v2:v2') != None:
        if msg.get('entities').get('v2:v2')[0].get('name') == "v2":
            return "إن الاتفاقية الدولية لحماية الأصناف النباتية الجديدة (اتفاقية الأويوف) تمنح مستولدي النباتات حق الملكية الفكرية على إنجازاتهم وذلك على أساس مجموعة واضحة من المبادئ. أما الدول الأعضاء في منظمة التجارة العالمية فهي ملزمة بموجب اتفاق تريبس بحماية الأصناف النباتية الجديدة بواسطة نظام البراءات أو بواسطة تشريع خاص بالنباتات أو من خلال الجمع بين هاتين الطريقتين. (م.27-3(ب))."
    if msg.get('entities').get('v3:v3') != None:
        if msg.get('entities').get('v3:v3')[0].get('name') == "v3":
            return "بموجب وثيقة 1991 للاتفاقية الدولية لحماية الأصناف النباتية الجديدة، يجب أن يكون الصنف: 1 - جديدة، مما يسمح بالتأكد من أن الصنف لم يتم استغلاله تجاريا. 2 - مميزة، أي يمكن تمييزه بوضوح عن أي صنف آخر يكون وجوده معروفا علانية في تاريخ إيداع الطلب. 3 - متجانسنا، أي متماثلا بما فيه الكفاية في خصائصه الأساسية، مع مراعاة الاختلاف المتوقع باعتبار ظروف كيفية تكاثره. (إستيلاد أو تكاثر). 4 - ثابتا، أي لا تتغير صفاته الأساسية إثر تكاثره المتتابع، أو في نهاية كل دورة خاصة للتكاثر. 5 - ومعينا بتسمية تسمح بتعريف الصنف."
    if msg.get('entities').get('v4:v4') != None:
        if msg.get('entities').get('v4:v4')[0].get('name') == "v4":
            return "بموجب وثيقة 1991 للاتفاقية الدولية لحماية الأصناف النباتية الجديدة التي تحدد نطاق حق مستولد النباتات فإنه يتعين على مستولد النباتات الحصول على تصريح مسبق لمباشرة الأعمال فيما يتعلق بما"
    if msg.get('entities').get('v5:v5') != None:
        if msg.get('entities').get('v5:v5')[0].get('name') == "v5":
            return "في حال لم تتح الفرصة لمستولد النباتات لكي يمارس حقه في ما يتعلق بمواد التوالد أو التكاثر المذكورة، وتم استولاد الأصناف من دون تصريحه، فإنه بإمكان مستولد النباتات أن يمارس حقه على المواد المحصودة."
    if msg.get('entities').get('v6:v6') != None:
        if msg.get('entities').get('v6:v6')[0].get('name') == "v6":
            return "يعوض مستولد النباتات استثماره من خلال الإتاوات التي يفرضها على الأشخاص الذين يصرح لهم بمباشرة الأعمال المذكورة سابقا ومن خلال الإتاوات التي يتضمنها سعر البذور التي يبيعها للمزارعين."
    if msg.get('entities').get('v7:v7') != None:
        if msg.get('entities').get('v7:v7')[0].get('name') == "v7":
            return "الحالات المستثناة من التصريح هي: • الأعمال المباشرة لأغراض شخصية غير تجارية. • الأعمال المباشرة على سبيل التجربة. • الأعمال المباشرة من أجل استولاد أصناف جديدة، إلا عندما يتعلق الأمر بالأصناف المشتقة وبعض الأصناف الأخرى التي لا يمكن استغلالها قبل الحصول على تصريح مستولد النباتات الأول."
    if msg.get('entities').get('v8:v8') != None:
        if msg.get('entities').get('v8:v8')[0].get('name') == "v8":
            return "إن الحد الأدنى للحماية بحسب وثيقة 1991 للاتفاقية هو: 25 عاما للأشجار والكروم. . 20 عاما للنباتات الأخرى."
    if msg.get('entities').get('v9:v9') != None:
        if msg.get('entities').get('v9:v9')[0].get('name') == "v9":
            return "كما هو الحال بالنسبة لنظم الحماية الأخرى، فإن كل بلد يمنح الحماية على حدة لمستولد النباتات الذي يرغب في حماية صنفه الجديد في هذا البلد. وتجيز اتفاقية الأوبوف إقامة نظم فوق وطنية للحماية تسمح بتخفيض النفقات والجهود المبذولة لحماية الصنف في عدة بلدان. ومن الأمثلة المكتب الأوروبي لحماية الأصناف النباتية الجديدة."
    if msg.get('entities').get('v10:v10') != None:
        if msg.get('entities').get('v10:v10')[0].get('name') == "v10":
            return "لا يمكن حماية صنف نباتي جديد يكتشف في منطقة برية ولا حماية قوانين الطبيعة."

    return 'آسفة لم افهم سؤالك، من فضلك يرجى إعادة صياغة السؤال بطريقة أخرى'



#